package com.ok100.weather.bean;

import java.util.List;

public class WeatherTotal7Bean {


    /**
     * ret : 200
     * data : {"cityinfo":{"provinces":"浙江","city":"杭州","area":"杭州","id":"101210101","prov_py":"zhejiang","city_py":"hangzhou","qh":"0571","jb":"2","yb":"310000","area_py":"hangzhou","area_short_code":"hz","lng":"120.153576","lat":"30.287459"},"day7":[{"date":"20191119","week":"二","nongli":"十月廿三","day_air_weather":"晴","night_air_weather":"晴","day_air_temperature":"14","night_air_temperature":"7","day_wind_power":"3-4级","night_wind_power":"<3级","day_wind_direction":"东北风","night_wind_direction":"微风","sun_begin":"06:27","sun_end":"17:01","day_weather_pic":"/day/00.png","night_weather_pic":"/day/00.png","aqi":"78","quality":"良","live":{"ac":{"name":"空调开启指数","title":"较少开启","desc":"您将感到很舒适，一般不需要开启空调。"},"ag":{"name":"过敏指数","title":"极不易发","desc":"天气条件极不易诱发过敏，可放心外出，享受生活。"},"cl":{"name":"晨练指数","title":"较不宜","desc":"风力稍大，较不宜晨练，室外锻炼请注意选择避风的地点，避免迎风锻炼。"},"co":{"name":"舒适度指数","title":"较不舒适","desc":"白天天气晴好，但仍会使您感觉偏冷，不很舒适，请注意适时添加衣物，以防感冒。"},"ct":{"name":"穿衣指数","title":"较冷","desc":"建议着厚外套加毛衣等服装。年老体弱者宜着大衣、呢外套加羊毛衫。"},"dy":{"name":"钓鱼指数","title":"较适宜","desc":"较适合垂钓，但风力稍大，会对垂钓产生一定的影响。"},"fs":{"name":"防晒指数","title":"中等","desc":"属中等强度紫外辐射天气，外出时应注意防护，建议涂擦SPF指数高于15，PA+的防晒护肤品。"},"gj":{"name":"逛街指数","title":"较适宜","desc":"天气较好，在这种天气里去逛街，既可畅快地放松身心，又会有很多意外收获，真是无比惬意。"},"gm":{"name":"感冒指数","title":"少发","desc":"各项气象条件适宜，无明显降温过程，发生感冒机率较低。"},"hc":{"name":"划船指数","title":"较适宜","desc":"白天较适宜划船，但气温稍低，风力较大，划船时注意适当加衣。"},"jt":{"name":"交通指数","title":"良好","desc":"天气较好，路面干燥，交通气象条件良好，车辆可以正常行驶。"},"lk":{"name":"路况指数","title":"干燥","desc":"天气较好，路面比较干燥，路况较好。"},"ls":{"name":"晾晒指数","title":"基本适宜","desc":"天气不错，午后温暖的阳光仍能满足你驱潮消霉杀菌的晾晒需求。"},"mf":{"name":"美发指数","title":"适宜","desc":"风大，这种天气会带走头发的水分并易弄脏头发，以致头发发涩，失去光泽，请使用含防晒和滋润成分的洗发护发品。"},"nl":{"name":"夜生活指数","title":"较适宜","desc":"天气较好，虽然有点风，比较适宜夜生活，您可以放心外出。"},"pj":{"name":"啤酒指数","title":"较不适宜","desc":"您将会感到有些凉意，建议饮用常温啤酒，并少量饮用为好。"},"pk":{"name":"放风筝指数","title":"适宜","desc":"天气不错，这种天气去放风筝既可以舒展筋骨，又可放松身心，超然自逸于广袤的天地之间。"},"pl":{"name":"空气污染扩散条件指数","title":"良","desc":"气象条件有利于空气污染物稀释、扩散和清除。"},"pp":{"name":"化妆指数","title":"保湿","desc":"皮肤易缺水，用润唇膏后再抹口红，用保湿型霜类化妆品。"},"tr":{"name":"旅游指数","title":"适宜","desc":"天气较好，风稍大，但温度适宜，是个好天气哦。适宜旅游，您可以尽情地享受大自然的无限风光。"},"uv":{"name":"紫外线强度指数","title":"中等","desc":"属中等强度紫外线辐射天气，外出时建议涂擦SPF高于15、PA+的防晒护肤品，戴帽子、太阳镜。"},"wc":{"name":"风寒指数","title":"凉","desc":"感觉有点凉，室外活动注意适当增减衣物。"},"xc":{"name":"洗车指数","title":"适宜","desc":"适宜洗车，未来持续两天无雨天气较好，适合擦洗汽车，蓝天白云、风和日丽将伴您的车子连日洁净。"},"xq":{"name":"心情指数","title":"好","desc":"天气较好，空气温润，和风飘飘，美好的天气会带来一天接踵而来的好心情。"},"yd":{"name":"运动指数","title":"较适宜","desc":"天气较好，但考虑风力较强且气温较低，推荐您进行室内运动，若在户外运动注意防风并适当增减衣物。"},"yh":{"name":"约会指数","title":"较适宜","desc":"虽然有点风，但情侣们可以放心外出，不用担心天气来调皮捣乱而影响了兴致。"},"ys":{"name":"雨伞指数","title":"不带伞","desc":"天气较好，您在出门的时候无须带雨伞。"},"zs":{"name":"中暑指数","title":"无中暑风险","desc":"天气不热，在炎炎夏日中十分难得，可以告别暑气漫漫啦~"},"gl":{"name":"太阳镜指数","title":"必要","desc":"白天天气晴朗，太阳辐射较强，建议佩戴透射比1级且标注UV380-UV400的遮阳镜"},"rw":{"name":"减肥气象指数","title":"null","desc":"null"},"bl":{"name":"健臻·血糖指数","title":"不易波动","desc":"天气条件好，血糖不易波动，可适时进行户外锻炼。"}}},{"live":{"ac":{"name":"空调开启指数","title":"较少开启","desc":"您将感到很舒适，一般不需要开启空调。"},"ag":{"name":"过敏指数","title":"极不易发","desc":"天气条件极不易诱发过敏，可放心外出，享受生活。"},"cl":{"name":"晨练指数","title":"较不宜","desc":"风力稍大，较不宜晨练，室外锻炼请注意选择避风的地点，避免迎风锻炼。"},"co":{"name":"舒适度指数","title":"较不舒适","desc":"白天风力较强，您会感觉偏冷，不很舒适，请注意添加衣物，以防感冒。"},"ct":{"name":"穿衣指数","title":"较冷","desc":"建议着厚外套加毛衣等服装。年老体弱者宜着大衣、呢外套加羊毛衫。"},"dy":{"name":"钓鱼指数","title":"较适宜","desc":"较适合垂钓，但风力稍大，会对垂钓产生一定的影响。"},"fs":{"name":"防晒指数","title":"较弱","desc":"紫外线强度较弱，建议涂擦SPF在12-15之间，PA+的防晒护肤品。"},"gj":{"name":"逛街指数","title":"较不宜","desc":"风力较大，较不适宜逛街，若坚持出门，请选择避风地点。"},"gm":{"name":"感冒指数","title":"较易发","desc":"虽然温度适宜但风力较大，仍较易发生感冒，体质较弱的朋友请注意适当防护。"},"hc":{"name":"划船指数","title":"较适宜","desc":"白天较适宜划船，但较大的风力会对划船产生一定的影响。"},"jt":{"name":"交通指数","title":"良好","desc":"天气较好，路面干燥，交通气象条件良好，车辆可以正常行驶。"},"lk":{"name":"路况指数","title":"干燥","desc":"天气较好，路面比较干燥，路况较好。"},"ls":{"name":"晾晒指数","title":"适宜","desc":"天气不错，适宜晾晒。赶紧把久未见阳光的衣物搬出来吸收一下太阳的味道吧！"},"mf":{"name":"美发指数","title":"适宜","desc":"气温适宜，但风力较大，这会导致空气中漂浮的尘埃增加，容易弄脏头发，请注意保持头发的清洁，并坚持使用润发露，有效防止头发干燥。　"},"nl":{"name":"夜生活指数","title":"较不适宜","desc":"天气较好，但风很大，会影响到您的出行，建议夜生活最好在室内进行。"},"pj":{"name":"啤酒指数","title":"较不适宜","desc":"您将会感到有些凉意，建议饮用常温啤酒，并少量饮用为好。"},"pk":{"name":"放风筝指数","title":"较适宜","desc":"温暖舒适，较适宜放风筝。"},"pl":{"name":"空气污染扩散条件指数","title":"良","desc":"气象条件有利于空气污染物稀释、扩散和清除。"},"pp":{"name":"化妆指数","title":"保湿","desc":"风力不大，建议用中性保湿型霜类化妆品，无需选用防晒化妆品。"},"tr":{"name":"旅游指数","title":"适宜","desc":"天气较好，温度适宜，但风稍微有点大。这样的天气适宜旅游，您可以尽情地享受大自然的无限风光。"},"uv":{"name":"紫外线强度指数","title":"弱","desc":"紫外线强度较弱，建议出门前涂擦SPF在12-15之间、PA+的防晒护肤品。"},"wc":{"name":"风寒指数","title":"无","desc":"温度未达到风寒所需的低温，稍作防寒准备即可。"},"xc":{"name":"洗车指数","title":"适宜","desc":"适宜洗车，未来持续两天无雨天气较好，适合擦洗汽车，蓝天白云、风和日丽将伴您的车子连日洁净。"},"xq":{"name":"心情指数","title":"较好","desc":"天气较好，暖阳万丈，温度舒适，您会觉得精神振奋，意气风发，心情舒畅。"},"yd":{"name":"运动指数","title":"较适宜","desc":"天气较好，但考虑风力较强且气温较低，推荐您进行室内运动，若在户外运动请注意防风并适当增减衣物。"},"yh":{"name":"约会指数","title":"较不适宜","desc":"风力较大，建议尽量不要去室外约会，如果外出，请您挑选避风的地点。"},"ys":{"name":"雨伞指数","title":"不带伞","desc":"天气较好，不会降水，因此您可放心出门，无须带雨伞。"},"zs":{"name":"中暑指数","title":"无中暑风险","desc":"天气舒适，令人神清气爽的一天，不用担心中暑的困扰。"},"gl":{"name":"太阳镜指数","title":"必要","desc":"白天太阳辐射较强，建议佩戴透射比1级且标注UV380-UV400的浅色太阳镜"},"rw":{"name":"减肥气象指数","title":"null","desc":"null"},"bl":{"name":"健臻·血糖指数","title":"不易波动","desc":"天气条件不易引起血糖波动。"}},"date":"20191120","week":"三","nongli":"十月廿四","day_air_weather":"多云","night_air_weather":"晴","day_air_temperature":"17","night_air_temperature":"9","day_wind_power":"4-5级","night_wind_power":"3-4级","day_wind_direction":"东风","night_wind_direction":"西风","sun_begin":"06:28","sun_end":"17:00","day_weather_pic":"/day/01.png","night_weather_pic":"/day/00.png","aqi":"50","quality":"优"},{"live":{"ac":{"name":"空调开启指数","title":"较少开启","desc":"您将感到很舒适，一般不需要开启空调。"},"ag":{"name":"过敏指数","title":"极不易发","desc":"天气条件极不易诱发过敏，可放心外出，享受生活。"},"cl":{"name":"晨练指数","title":"较不宜","desc":"风力稍大，较不宜晨练，室外锻炼请注意选择避风的地点，避免迎风锻炼。"},"co":{"name":"舒适度指数","title":"较舒适","desc":"白天天气晴好，早晚会感觉偏凉，午后舒适、宜人。"},"ct":{"name":"穿衣指数","title":"较舒适","desc":"建议着薄外套、开衫牛仔衫裤等服装。年老体弱者应适当添加衣物，宜着夹克衫、薄毛衣等。"},"dy":{"name":"钓鱼指数","title":"较适宜","desc":"较适合垂钓，但风力稍大，会对垂钓产生一定的影响。"},"fs":{"name":"防晒指数","title":"较弱","desc":"紫外线强度较弱，建议涂擦SPF在12-15之间，PA+的防晒护肤品。"},"gj":{"name":"逛街指数","title":"较适宜","desc":"天气较好，在这种天气里去逛街，既可畅快地放松身心，又会有很多意外收获，真是无比惬意。"},"gm":{"name":"感冒指数","title":"少发","desc":"各项气象条件适宜，无明显降温过程，发生感冒机率较低。"},"hc":{"name":"划船指数","title":"较适宜","desc":"白天较适宜划船，但较大的风力会对划船产生一定的影响。"},"jt":{"name":"交通指数","title":"良好","desc":"天气较好，路面干燥，交通气象条件良好，车辆可以正常行驶。"},"lk":{"name":"路况指数","title":"干燥","desc":"天气较好，路面比较干燥，路况较好。"},"ls":{"name":"晾晒指数","title":"适宜","desc":"天气不错，适宜晾晒。赶紧把久未见阳光的衣物搬出来吸收一下太阳的味道吧！"},"mf":{"name":"美发指数","title":"适宜","desc":"气温适宜，但风力较大，这会导致空气中漂浮的尘埃增加，容易弄脏头发，请注意保持头发的清洁，并坚持使用润发露，有效防止头发干燥。　"},"nl":{"name":"夜生活指数","title":"较适宜","desc":"天气较好，虽然有点风，但仍比较适宜夜生活，您可以放心外出。"},"pj":{"name":"啤酒指数","title":"较适宜","desc":"适量的饮用啤酒可能会更增加您舒适的感觉，但要注意千万不要过量呦。"},"pk":{"name":"放风筝指数","title":"较适宜","desc":"温暖舒适，较适宜放风筝。"},"pl":{"name":"空气污染扩散条件指数","title":"良","desc":"气象条件有利于空气污染物稀释、扩散和清除。"},"pp":{"name":"化妆指数","title":"保湿","desc":"风力不大，建议用中性保湿型霜类化妆品，无需选用防晒化妆品。"},"tr":{"name":"旅游指数","title":"适宜","desc":"天气较好，温度适宜，但风稍微有点大。这样的天气适宜旅游，您可以尽情地享受大自然的无限风光。"},"uv":{"name":"紫外线强度指数","title":"弱","desc":"紫外线强度较弱，建议出门前涂擦SPF在12-15之间、PA+的防晒护肤品。"},"wc":{"name":"风寒指数","title":"无","desc":"温度未达到风寒所需的低温，稍作防寒准备即可。"},"xc":{"name":"洗车指数","title":"适宜","desc":"适宜洗车，未来持续两天无雨天气较好，适合擦洗汽车，蓝天白云、风和日丽将伴您的车子连日洁净。"},"xq":{"name":"心情指数","title":"较好","desc":"天气较好，温度适宜，心情会不错，学习、工作效率较高。"},"yd":{"name":"运动指数","title":"较适宜","desc":"天气较好，但因风力稍强，户外可选择对风力要求不高的运动，推荐您进行室内运动。"},"yh":{"name":"约会指数","title":"较适宜","desc":"虽然有点风，但情侣们可以放心外出，不用担心天气来调皮捣乱而影响了兴致。"},"ys":{"name":"雨伞指数","title":"不带伞","desc":"天气较好，不会降水，因此您可放心出门，无须带雨伞。"},"zs":{"name":"中暑指数","title":"无中暑风险","desc":"天气舒适，令人神清气爽的一天，不用担心中暑的困扰。"},"gl":{"name":"太阳镜指数","title":"必要","desc":"白天太阳辐射较强，建议佩戴透射比1级且标注UV380-UV400的浅色太阳镜"},"rw":{"name":"减肥气象指数","title":"null","desc":"null"},"bl":{"name":"健臻·血糖指数","title":"不易波动","desc":"天气条件好，血糖不易波动，可适时进行户外锻炼。"}},"date":"20191121","week":"四","nongli":"十月廿五","day_air_weather":"多云","night_air_weather":"晴","day_air_temperature":"20","night_air_temperature":"10","day_wind_power":"3-4级","night_wind_power":"<3级","day_wind_direction":"西风","night_wind_direction":"微风","sun_begin":"06:29","sun_end":"17:00","day_weather_pic":"/day/01.png","night_weather_pic":"/day/00.png","aqi":"55","quality":"良"},{"live":{"ac":{"name":"空调开启指数","title":"较少开启","desc":"您将感到很舒适，一般不需要开启空调。"},"ag":{"name":"过敏指数","title":"极不易发","desc":"天气条件极不易诱发过敏，可放心外出，享受生活。"},"cl":{"name":"晨练指数","title":"较不宜","desc":"风力稍大，较不宜晨练，室外锻炼请注意选择避风的地点，避免迎风锻炼。"},"co":{"name":"舒适度指数","title":"舒适","desc":"白天不太热也不太冷，风力不大，相信您在这样的天气条件下，应会感到比较清爽和舒适。"},"ct":{"name":"穿衣指数","title":"较舒适","desc":"建议着薄外套、开衫牛仔衫裤等服装。年老体弱者应适当添加衣物，宜着夹克衫、薄毛衣等。"},"dy":{"name":"钓鱼指数","title":"较适宜","desc":"较适合垂钓，但风力稍大，会对垂钓产生一定的影响。"},"fs":{"name":"防晒指数","title":"较弱","desc":"紫外线强度较弱，建议涂擦SPF在12-15之间，PA+的防晒护肤品。"},"gj":{"name":"逛街指数","title":"较适宜","desc":"天气较好，在这种天气里去逛街，既可畅快地放松身心，又会有很多意外收获，真是无比惬意。"},"gm":{"name":"感冒指数","title":"少发","desc":"各项气象条件适宜，无明显降温过程，发生感冒机率较低。"},"hc":{"name":"划船指数","title":"较适宜","desc":"白天较适宜划船，但较大的风力会对划船产生一定的影响。"},"jt":{"name":"交通指数","title":"良好","desc":"天气较好，路面干燥，交通气象条件良好，车辆可以正常行驶。"},"lk":{"name":"路况指数","title":"干燥","desc":"天气较好，路面比较干燥，路况较好。"},"ls":{"name":"晾晒指数","title":"适宜","desc":"天气不错，适宜晾晒。赶紧把久未见阳光的衣物搬出来吸收一下太阳的味道吧！"},"mf":{"name":"美发指数","title":"适宜","desc":"气温适宜，但风力较大，这会导致空气中漂浮的尘埃增加，容易弄脏头发，请注意保持头发的清洁，并坚持使用润发露，有效防止头发干燥。　"},"nl":{"name":"夜生活指数","title":"较适宜","desc":"天气较好，虽然有点风，但仍比较适宜夜生活，您可以放心外出。"},"pj":{"name":"啤酒指数","title":"较适宜","desc":"适量的饮用啤酒可能会更增加您舒适的感觉，但要注意千万不要过量呦。"},"pk":{"name":"放风筝指数","title":"较适宜","desc":"温暖舒适，较适宜放风筝。"},"pl":{"name":"空气污染扩散条件指数","title":"良","desc":"气象条件有利于空气污染物稀释、扩散和清除。"},"pp":{"name":"化妆指数","title":"保湿","desc":"风力不大，建议用中性保湿型霜类化妆品，无需选用防晒化妆品。"},"tr":{"name":"旅游指数","title":"适宜","desc":"天气较好，温度适宜，但风稍微有点大。这样的天气适宜旅游，您可以尽情地享受大自然的无限风光。"},"uv":{"name":"紫外线强度指数","title":"弱","desc":"紫外线强度较弱，建议出门前涂擦SPF在12-15之间、PA+的防晒护肤品。"},"wc":{"name":"风寒指数","title":"无","desc":"温度未达到风寒所需的低温，稍作防寒准备即可。"},"xc":{"name":"洗车指数","title":"适宜","desc":"适宜洗车，未来持续两天无雨天气较好，适合擦洗汽车，蓝天白云、风和日丽将伴您的车子连日洁净。"},"xq":{"name":"心情指数","title":"较好","desc":"天气较好，温度适宜，心情会不错，学习、工作效率较高。"},"yd":{"name":"运动指数","title":"较适宜","desc":"天气较好，但因风力稍强，户外可选择对风力要求不高的运动，推荐您进行室内运动。"},"yh":{"name":"约会指数","title":"较适宜","desc":"虽然有点风，但情侣们可以放心外出，不用担心天气来调皮捣乱而影响了兴致。"},"ys":{"name":"雨伞指数","title":"不带伞","desc":"天气较好，不会降水，因此您可放心出门，无须带雨伞。"},"zs":{"name":"中暑指数","title":"无中暑风险","desc":"天气舒适，令人神清气爽的一天，不用担心中暑的困扰。"},"gl":{"name":"太阳镜指数","title":"必要","desc":"白天太阳辐射较强，建议佩戴透射比1级且标注UV380-UV400的浅色太阳镜"},"rw":{"name":"减肥气象指数","title":"null","desc":"null"},"bl":{"name":"健臻·血糖指数","title":"较易波动","desc":"血糖较易波动，注意监测。"}},"date":"20191122","week":"五","nongli":"十月廿六","day_air_weather":"多云","night_air_weather":"多云","day_air_temperature":"22","night_air_temperature":"12","day_wind_power":"3-4级","night_wind_power":"<3级","day_wind_direction":"西风","night_wind_direction":"微风","sun_begin":"06:30","sun_end":"17:00","day_weather_pic":"/day/01.png","night_weather_pic":"/day/01.png","aqi":"67","quality":"良"},{"live":{"ac":{"name":"空调开启指数","title":"较少开启","desc":"您将感到很舒适，一般不需要开启空调。"},"ag":{"name":"过敏指数","title":"极不易发","desc":"天气条件极不易诱发过敏，可放心外出，享受生活。"},"cl":{"name":"晨练指数","title":"适宜","desc":"天气不错，空气清新，是您晨练的大好时机，建议不同年龄段的人们积极参加户外健身活动。"},"co":{"name":"舒适度指数","title":"舒适","desc":"白天不太热也不太冷，风力不大，相信您在这样的天气条件下，应会感到比较清爽和舒适。"},"ct":{"name":"穿衣指数","title":"舒适","desc":"建议着长袖T恤、衬衫加单裤等服装。年老体弱者宜着针织长袖衬衫、马甲和长裤。"},"dy":{"name":"钓鱼指数","title":"较适宜","desc":"较适合垂钓，但风力稍大，会对垂钓产生一定的影响。"},"fs":{"name":"防晒指数","title":"较弱","desc":"紫外线强度较弱，建议涂擦SPF在12-15之间，PA+的防晒护肤品。"},"gj":{"name":"逛街指数","title":"适宜","desc":"天气较好，在这种天气里去逛街，既可畅快地放松身心，又会有很多意外收获，真是无比惬意。"},"gm":{"name":"感冒指数","title":"较易发","desc":"天气转凉，空气湿度较大，较易发生感冒，体质较弱的朋友请注意适当防护。"},"hc":{"name":"划船指数","title":"适宜","desc":"白天天气较好，适宜划船或嬉玩各种水上运动。"},"jt":{"name":"交通指数","title":"良好","desc":"天气较好，路面干燥，交通气象条件良好，车辆可以正常行驶。"},"lk":{"name":"路况指数","title":"干燥","desc":"天气较好，路面比较干燥，路况较好。"},"ls":{"name":"晾晒指数","title":"适宜","desc":"天气不错，适宜晾晒。赶紧把久未见阳光的衣物搬出来吸收一下太阳的味道吧！"},"mf":{"name":"美发指数","title":"极适宜","desc":"温湿适宜，风力较小，这为您的头发创造一个健康、洁净的生长环境，加上您细心的呵护打理，您的秀发定能飘逸动人。"},"nl":{"name":"夜生活指数","title":"较适宜","desc":"天气较好，虽然有点风，但仍比较适宜夜生活，您可以放心外出。"},"pj":{"name":"啤酒指数","title":"较适宜","desc":"适量的饮用啤酒可能会更增加您舒适的感觉，但要注意千万不要过量呦。"},"pk":{"name":"放风筝指数","title":"较适宜","desc":"温暖舒适，较适宜放风筝。"},"pl":{"name":"空气污染扩散条件指数","title":"中","desc":"气象条件对空气污染物稀释、扩散和清除无明显影响。"},"pp":{"name":"化妆指数","title":"去油","desc":"天气较热，建议用露质面霜打底，水质无油粉底霜，透明粉饼，粉质胭脂。"},"tr":{"name":"旅游指数","title":"适宜","desc":"天气较好，但丝毫不会影响您出行的心情。温度适宜又有微风相伴，适宜旅游。"},"uv":{"name":"紫外线强度指数","title":"弱","desc":"紫外线强度较弱，建议出门前涂擦SPF在12-15之间、PA+的防晒护肤品。"},"wc":{"name":"风寒指数","title":"无","desc":"温度未达到风寒所需的低温，稍作防寒准备即可。"},"xc":{"name":"洗车指数","title":"较适宜","desc":"较适宜洗车，未来一天无雨，风力较小，擦洗一新的汽车至少能保持一天。"},"xq":{"name":"心情指数","title":"较好","desc":"天气较好，温度适宜，心情会不错，学习、工作效率较高。"},"yd":{"name":"运动指数","title":"适宜","desc":"天气较好，赶快投身大自然参与户外运动，尽情感受运动的快乐吧。"},"yh":{"name":"约会指数","title":"较适宜","desc":"虽然有点风，但情侣们可以放心外出，不用担心天气来调皮捣乱而影响了兴致。"},"ys":{"name":"雨伞指数","title":"不带伞","desc":"天气较好，不会降水，因此您可放心出门，无须带雨伞。"},"zs":{"name":"中暑指数","title":"无中暑风险","desc":"天气舒适，令人神清气爽的一天，不用担心中暑的困扰。"},"gl":{"name":"太阳镜指数","title":"很必要","desc":"白天虽有白云遮挡，但太阳辐射仍很强，建议佩戴透射比2级且标注UV400的遮阳镜"},"rw":{"name":"减肥气象指数","title":"null","desc":"null"},"bl":{"name":"健臻·血糖指数","title":"较易波动","desc":"血糖较易波动，注意监测。"}},"date":"20191123","week":"六","nongli":"十月廿七","day_air_weather":"多云","night_air_weather":"多云","day_air_temperature":"25","night_air_temperature":"16","day_wind_power":"<3级","night_wind_power":"<3级","day_wind_direction":"微风","night_wind_direction":"微风","sun_begin":"06:30","sun_end":"16:59","day_weather_pic":"/day/01.png","night_weather_pic":"/day/01.png","aqi":"49","quality":"优"},{"live":{"ac":{"name":"空调开启指数","title":"较少开启","desc":"您将感到很舒适，一般不需要开启空调。"},"ag":{"name":"过敏指数","title":"极不易发","desc":"天气条件极不易诱发过敏，可放心外出，享受生活。"},"cl":{"name":"晨练指数","title":"较不宜","desc":"风力稍大，较不宜晨练，室外锻炼请注意选择避风的地点，避免迎风锻炼。"},"co":{"name":"舒适度指数","title":"舒适","desc":"白天不太热也不太冷，风力不大，相信您在这样的天气条件下，应会感到比较清爽和舒适。"},"ct":{"name":"穿衣指数","title":"舒适","desc":"建议着长袖T恤、衬衫加单裤等服装。年老体弱者宜着针织长袖衬衫、马甲和长裤。"},"dy":{"name":"钓鱼指数","title":"较适宜","desc":"较适合垂钓，但风力稍大，会对垂钓产生一定的影响。"},"fs":{"name":"防晒指数","title":"弱","desc":"属弱紫外辐射天气，长期在户外，建议涂擦SPF在8-12之间的防晒护肤品。"},"gj":{"name":"逛街指数","title":"较不宜","desc":"风力较大，较不适宜逛街，若坚持出门，请选择避风地点。"},"gm":{"name":"感冒指数","title":"较易发","desc":"虽然温度适宜但风力较大，仍较易发生感冒，体质较弱的朋友请注意适当防护。"},"hc":{"name":"划船指数","title":"较适宜","desc":"白天较适宜划船，但较大的风力会对划船产生一定的影响。"},"jt":{"name":"交通指数","title":"良好","desc":"天气较好，路面干燥，交通气象条件良好，车辆可以正常行驶。"},"lk":{"name":"路况指数","title":"干燥","desc":"天气较好，路面比较干燥，路况较好。"},"ls":{"name":"晾晒指数","title":"适宜","desc":"天气不错，适宜晾晒。赶紧把久未见阳光的衣物搬出来吸收一下太阳的味道吧！"},"mf":{"name":"美发指数","title":"适宜","desc":"气温适宜，但风力较大，这会导致空气中漂浮的尘埃增加，容易弄脏头发，请注意保持头发的清洁，并坚持使用润发露，有效防止头发干燥。　"},"nl":{"name":"夜生活指数","title":"较不适宜","desc":"天气较好，但风很大，会影响到您的出行，建议夜生活最好在室内进行。"},"pj":{"name":"啤酒指数","title":"适宜","desc":"炎热的天气可能增加啤酒对您的诱惑，适量饮用啤酒会给您带来清凉的感觉，但千万注意不要过量呦！"},"pk":{"name":"放风筝指数","title":"较适宜","desc":"温暖舒适，较适宜放风筝。"},"pl":{"name":"空气污染扩散条件指数","title":"良","desc":"气象条件有利于空气污染物稀释、扩散和清除。"},"pp":{"name":"化妆指数","title":"去油","desc":"天气较热，建议用露质面霜打底，水质无油粉底霜，透明粉饼，粉质胭脂。"},"tr":{"name":"旅游指数","title":"适宜","desc":"天气较好，温度适宜，但风稍微有点大。这样的天气适宜旅游，您可以尽情地享受大自然的无限风光。"},"uv":{"name":"紫外线强度指数","title":"最弱","desc":"属弱紫外线辐射天气，无需特别防护。若长期在户外，建议涂擦SPF在8-12之间的防晒护肤品。"},"wc":{"name":"风寒指数","title":"无","desc":"温度未达到风寒所需的低温，稍作防寒准备即可。"},"xc":{"name":"洗车指数","title":"不宜","desc":"不宜洗车，未来24小时内有雨，如果在此期间洗车，雨水和路上的泥水可能会再次弄脏您的爱车。"},"xq":{"name":"心情指数","title":"较好","desc":"天气较好，暖阳万丈，温度舒适，您会觉得精神振奋，意气风发，心情舒畅。"},"yd":{"name":"运动指数","title":"较适宜","desc":"天气较好，但因风力稍强，户外可选择对风力要求不高的运动，推荐您进行室内运动。"},"yh":{"name":"约会指数","title":"较不适宜","desc":"风力较大，建议尽量不要去室外约会，如果外出，请您挑选避风的地点。"},"ys":{"name":"雨伞指数","title":"不带伞","desc":"天气较好，不会降水，因此您可放心出门，无须带雨伞。"},"zs":{"name":"中暑指数","title":"无中暑风险","desc":"天气不热，在炎炎夏日中十分难得，可以告别暑气漫漫啦~"},"gl":{"name":"太阳镜指数","title":"很必要","desc":"白天虽有白云遮挡，但太阳辐射仍很强，建议佩戴透射比2级且标注UV400的遮阳镜"},"rw":{"name":"减肥气象指数","title":"null","desc":"null"},"bl":{"name":"健臻·血糖指数","title":"较易波动","desc":"风力较大，血糖较易波动，注意监测。"}},"date":"20191124","week":"日","nongli":"十月廿八","day_air_weather":"多云","night_air_weather":"小雨","day_air_temperature":"27","night_air_temperature":"11","day_wind_power":"4-5级","night_wind_power":"5-6级","day_wind_direction":"西风","night_wind_direction":"北风","sun_begin":"06:31","sun_end":"16:59","day_weather_pic":"/day/01.png","night_weather_pic":"/day/07.png","aqi":"","quality":""},{"live":{"ac":{"name":"空调开启指数","title":"较少开启","desc":"您将感到很舒适，一般不需要开启空调。"},"ag":{"name":"过敏指数","title":"极不易发","desc":"天气条件极不易诱发过敏，可放心外出，享受生活。"},"cl":{"name":"晨练指数","title":"较不宜","desc":"阴天，风力稍大，较不宜晨练，室外锻炼请注意选择避风的地点，避免迎风锻炼。"},"co":{"name":"舒适度指数","title":"很不舒适","desc":"白天天阴风大，且天气凉，在这种天气条件下，会感觉很冷，不舒适，外出不宜过久，并注意防风保暖。"},"ct":{"name":"穿衣指数","title":"冷","desc":"天气冷，建议着棉服、羽绒服、皮夹克加羊毛衫等冬季服装。年老体弱者宜着厚棉衣、冬大衣或厚羽绒服。"},"dy":{"name":"钓鱼指数","title":"不宜","desc":"天气不好，有风，不适合垂钓。"},"fs":{"name":"防晒指数","title":"弱","desc":"属弱紫外辐射天气，长期在户外，建议涂擦SPF在8-12之间的防晒护肤品。"},"gj":{"name":"逛街指数","title":"较不宜","desc":"风力较大，较不适宜逛街，若坚持出门，请选择避风地点。"},"gm":{"name":"感冒指数","title":"极易发","desc":"将有一次强降温过程，且风力较强，极易发生感冒，请特别注意增加衣服保暖防寒。"},"hc":{"name":"划船指数","title":"较适宜","desc":"白天较适宜划船，考虑气温稍低，天气阴沉，风力较大，划船时小心着凉。"},"jt":{"name":"交通指数","title":"良好","desc":"阴天，路面干燥，交通气象条件良好，车辆可以正常行驶。"},"lk":{"name":"路况指数","title":"干燥","desc":"阴天，路面比较干燥，路况较好。"},"ls":{"name":"晾晒指数","title":"不太适宜","desc":"天气阴沉，不利于水分的迅速蒸发，不太适宜晾晒。若需要晾晒，请尽量选择通风的地点。"},"mf":{"name":"美发指数","title":"适宜","desc":"较强的风力不仅易弄脏头发，还会带走头发的水分，以致头发发质变干，失去光泽，请注意保持头发的清洁，使用滋润型洗发露和护发素。"},"nl":{"name":"夜生活指数","title":"较不适宜","desc":"天气阴沉，而且风力很大，会给您的出行带来不便，建议夜生活最好在室内进行。"},"pj":{"name":"啤酒指数","title":"较不适宜","desc":"您将会感到有些凉意，建议饮用常温啤酒，并少量饮用为好。"},"pk":{"name":"放风筝指数","title":"不宜","desc":"天气不好，不适宜放风筝。"},"pl":{"name":"空气污染扩散条件指数","title":"良","desc":"气象条件有利于空气污染物稀释、扩散和清除。"},"pp":{"name":"化妆指数","title":"保湿","desc":"气温较低，风力较大，用滋润型化妆品，少扑粉，用润唇膏后再抹口红。"},"tr":{"name":"旅游指数","title":"适宜","desc":"天气较好，风稍大，但温度适宜，总体来说还是好天气。这样的天气适宜旅游，您可以尽情享受大自然的风光。"},"uv":{"name":"紫外线强度指数","title":"最弱","desc":"属弱紫外线辐射天气，无需特别防护。若长期在户外，建议涂擦SPF在8-12之间的防晒护肤品。"},"wc":{"name":"风寒指数","title":"凉","desc":"风力较大，感觉有点凉，室外活动注意适当增减衣物。"},"xc":{"name":"洗车指数","title":"适宜","desc":"适宜洗车，未来持续两天无雨天气较好，适合擦洗汽车，蓝天白云、风和日丽将伴您的车子连日洁净。"},"xq":{"name":"心情指数","title":"较差","desc":"天气阴沉，会感觉莫名的压抑，情绪低落，此时将所有的悲喜都静静地沉到心底，在喧嚣的尘世里，感受片刻恬淡的宁静。"},"yd":{"name":"运动指数","title":"较不宜","desc":"有降水，且风力较强，推荐您在室内进行各种健身休闲运动；若坚持户外运动，请注意防风保暖。"},"yh":{"name":"约会指数","title":"较不适宜","desc":"阴天且风力较大，建议尽量不要去室外约会，如果外出，请您挑选避风的地点。"},"ys":{"name":"雨伞指数","title":"不带伞","desc":"阴天，但降水概率很低，因此您在出门的时候无须带雨伞。"},"zs":{"name":"中暑指数","title":"无中暑风险","desc":"天气舒适，对易中暑人群来说非常友善。"},"gl":{"name":"太阳镜指数","title":"必要","desc":"白天天空阴沉，但太阳辐射较强，建议佩戴透射比1级且标注UV380-UV400的浅色太阳镜"},"rw":{"name":"减肥气象指数","title":"null","desc":"null"},"bl":{"name":"健臻·血糖指数","title":"易波动","desc":"气温多变，血糖易波动，注意监测血糖变化。"}},"date":"20191125","week":"一","nongli":"十月廿九","day_air_weather":"阴","night_air_weather":"多云","day_air_temperature":"12","night_air_temperature":"6","day_wind_power":"4-5级","night_wind_power":"3-4级","day_wind_direction":"北风","night_wind_direction":"西风","sun_begin":"06:32","sun_end":"16:59","day_weather_pic":"/day/02.png","night_weather_pic":"/day/01.png","aqi":"","quality":""}]}
     * qt : 0.023
     */

    private int ret;
    private DataBean data;
    private double qt;

    public int getRet() {
        return ret;
    }

    public void setRet(int ret) {
        this.ret = ret;
    }

    public DataBean getData() {
        return data;
    }

    public void setData(DataBean data) {
        this.data = data;
    }

    public double getQt() {
        return qt;
    }

    public void setQt(double qt) {
        this.qt = qt;
    }

    public static class DataBean {
        /**
         * cityinfo : {"provinces":"浙江","city":"杭州","area":"杭州","id":"101210101","prov_py":"zhejiang","city_py":"hangzhou","qh":"0571","jb":"2","yb":"310000","area_py":"hangzhou","area_short_code":"hz","lng":"120.153576","lat":"30.287459"}
         * day7 : [{"date":"20191119","week":"二","nongli":"十月廿三","day_air_weather":"晴","night_air_weather":"晴","day_air_temperature":"14","night_air_temperature":"7","day_wind_power":"3-4级","night_wind_power":"<3级","day_wind_direction":"东北风","night_wind_direction":"微风","sun_begin":"06:27","sun_end":"17:01","day_weather_pic":"/day/00.png","night_weather_pic":"/day/00.png","aqi":"78","quality":"良","live":{"ac":{"name":"空调开启指数","title":"较少开启","desc":"您将感到很舒适，一般不需要开启空调。"},"ag":{"name":"过敏指数","title":"极不易发","desc":"天气条件极不易诱发过敏，可放心外出，享受生活。"},"cl":{"name":"晨练指数","title":"较不宜","desc":"风力稍大，较不宜晨练，室外锻炼请注意选择避风的地点，避免迎风锻炼。"},"co":{"name":"舒适度指数","title":"较不舒适","desc":"白天天气晴好，但仍会使您感觉偏冷，不很舒适，请注意适时添加衣物，以防感冒。"},"ct":{"name":"穿衣指数","title":"较冷","desc":"建议着厚外套加毛衣等服装。年老体弱者宜着大衣、呢外套加羊毛衫。"},"dy":{"name":"钓鱼指数","title":"较适宜","desc":"较适合垂钓，但风力稍大，会对垂钓产生一定的影响。"},"fs":{"name":"防晒指数","title":"中等","desc":"属中等强度紫外辐射天气，外出时应注意防护，建议涂擦SPF指数高于15，PA+的防晒护肤品。"},"gj":{"name":"逛街指数","title":"较适宜","desc":"天气较好，在这种天气里去逛街，既可畅快地放松身心，又会有很多意外收获，真是无比惬意。"},"gm":{"name":"感冒指数","title":"少发","desc":"各项气象条件适宜，无明显降温过程，发生感冒机率较低。"},"hc":{"name":"划船指数","title":"较适宜","desc":"白天较适宜划船，但气温稍低，风力较大，划船时注意适当加衣。"},"jt":{"name":"交通指数","title":"良好","desc":"天气较好，路面干燥，交通气象条件良好，车辆可以正常行驶。"},"lk":{"name":"路况指数","title":"干燥","desc":"天气较好，路面比较干燥，路况较好。"},"ls":{"name":"晾晒指数","title":"基本适宜","desc":"天气不错，午后温暖的阳光仍能满足你驱潮消霉杀菌的晾晒需求。"},"mf":{"name":"美发指数","title":"适宜","desc":"风大，这种天气会带走头发的水分并易弄脏头发，以致头发发涩，失去光泽，请使用含防晒和滋润成分的洗发护发品。"},"nl":{"name":"夜生活指数","title":"较适宜","desc":"天气较好，虽然有点风，比较适宜夜生活，您可以放心外出。"},"pj":{"name":"啤酒指数","title":"较不适宜","desc":"您将会感到有些凉意，建议饮用常温啤酒，并少量饮用为好。"},"pk":{"name":"放风筝指数","title":"适宜","desc":"天气不错，这种天气去放风筝既可以舒展筋骨，又可放松身心，超然自逸于广袤的天地之间。"},"pl":{"name":"空气污染扩散条件指数","title":"良","desc":"气象条件有利于空气污染物稀释、扩散和清除。"},"pp":{"name":"化妆指数","title":"保湿","desc":"皮肤易缺水，用润唇膏后再抹口红，用保湿型霜类化妆品。"},"tr":{"name":"旅游指数","title":"适宜","desc":"天气较好，风稍大，但温度适宜，是个好天气哦。适宜旅游，您可以尽情地享受大自然的无限风光。"},"uv":{"name":"紫外线强度指数","title":"中等","desc":"属中等强度紫外线辐射天气，外出时建议涂擦SPF高于15、PA+的防晒护肤品，戴帽子、太阳镜。"},"wc":{"name":"风寒指数","title":"凉","desc":"感觉有点凉，室外活动注意适当增减衣物。"},"xc":{"name":"洗车指数","title":"适宜","desc":"适宜洗车，未来持续两天无雨天气较好，适合擦洗汽车，蓝天白云、风和日丽将伴您的车子连日洁净。"},"xq":{"name":"心情指数","title":"好","desc":"天气较好，空气温润，和风飘飘，美好的天气会带来一天接踵而来的好心情。"},"yd":{"name":"运动指数","title":"较适宜","desc":"天气较好，但考虑风力较强且气温较低，推荐您进行室内运动，若在户外运动注意防风并适当增减衣物。"},"yh":{"name":"约会指数","title":"较适宜","desc":"虽然有点风，但情侣们可以放心外出，不用担心天气来调皮捣乱而影响了兴致。"},"ys":{"name":"雨伞指数","title":"不带伞","desc":"天气较好，您在出门的时候无须带雨伞。"},"zs":{"name":"中暑指数","title":"无中暑风险","desc":"天气不热，在炎炎夏日中十分难得，可以告别暑气漫漫啦~"},"gl":{"name":"太阳镜指数","title":"必要","desc":"白天天气晴朗，太阳辐射较强，建议佩戴透射比1级且标注UV380-UV400的遮阳镜"},"rw":{"name":"减肥气象指数","title":"null","desc":"null"},"bl":{"name":"健臻·血糖指数","title":"不易波动","desc":"天气条件好，血糖不易波动，可适时进行户外锻炼。"}}},{"live":{"ac":{"name":"空调开启指数","title":"较少开启","desc":"您将感到很舒适，一般不需要开启空调。"},"ag":{"name":"过敏指数","title":"极不易发","desc":"天气条件极不易诱发过敏，可放心外出，享受生活。"},"cl":{"name":"晨练指数","title":"较不宜","desc":"风力稍大，较不宜晨练，室外锻炼请注意选择避风的地点，避免迎风锻炼。"},"co":{"name":"舒适度指数","title":"较不舒适","desc":"白天风力较强，您会感觉偏冷，不很舒适，请注意添加衣物，以防感冒。"},"ct":{"name":"穿衣指数","title":"较冷","desc":"建议着厚外套加毛衣等服装。年老体弱者宜着大衣、呢外套加羊毛衫。"},"dy":{"name":"钓鱼指数","title":"较适宜","desc":"较适合垂钓，但风力稍大，会对垂钓产生一定的影响。"},"fs":{"name":"防晒指数","title":"较弱","desc":"紫外线强度较弱，建议涂擦SPF在12-15之间，PA+的防晒护肤品。"},"gj":{"name":"逛街指数","title":"较不宜","desc":"风力较大，较不适宜逛街，若坚持出门，请选择避风地点。"},"gm":{"name":"感冒指数","title":"较易发","desc":"虽然温度适宜但风力较大，仍较易发生感冒，体质较弱的朋友请注意适当防护。"},"hc":{"name":"划船指数","title":"较适宜","desc":"白天较适宜划船，但较大的风力会对划船产生一定的影响。"},"jt":{"name":"交通指数","title":"良好","desc":"天气较好，路面干燥，交通气象条件良好，车辆可以正常行驶。"},"lk":{"name":"路况指数","title":"干燥","desc":"天气较好，路面比较干燥，路况较好。"},"ls":{"name":"晾晒指数","title":"适宜","desc":"天气不错，适宜晾晒。赶紧把久未见阳光的衣物搬出来吸收一下太阳的味道吧！"},"mf":{"name":"美发指数","title":"适宜","desc":"气温适宜，但风力较大，这会导致空气中漂浮的尘埃增加，容易弄脏头发，请注意保持头发的清洁，并坚持使用润发露，有效防止头发干燥。　"},"nl":{"name":"夜生活指数","title":"较不适宜","desc":"天气较好，但风很大，会影响到您的出行，建议夜生活最好在室内进行。"},"pj":{"name":"啤酒指数","title":"较不适宜","desc":"您将会感到有些凉意，建议饮用常温啤酒，并少量饮用为好。"},"pk":{"name":"放风筝指数","title":"较适宜","desc":"温暖舒适，较适宜放风筝。"},"pl":{"name":"空气污染扩散条件指数","title":"良","desc":"气象条件有利于空气污染物稀释、扩散和清除。"},"pp":{"name":"化妆指数","title":"保湿","desc":"风力不大，建议用中性保湿型霜类化妆品，无需选用防晒化妆品。"},"tr":{"name":"旅游指数","title":"适宜","desc":"天气较好，温度适宜，但风稍微有点大。这样的天气适宜旅游，您可以尽情地享受大自然的无限风光。"},"uv":{"name":"紫外线强度指数","title":"弱","desc":"紫外线强度较弱，建议出门前涂擦SPF在12-15之间、PA+的防晒护肤品。"},"wc":{"name":"风寒指数","title":"无","desc":"温度未达到风寒所需的低温，稍作防寒准备即可。"},"xc":{"name":"洗车指数","title":"适宜","desc":"适宜洗车，未来持续两天无雨天气较好，适合擦洗汽车，蓝天白云、风和日丽将伴您的车子连日洁净。"},"xq":{"name":"心情指数","title":"较好","desc":"天气较好，暖阳万丈，温度舒适，您会觉得精神振奋，意气风发，心情舒畅。"},"yd":{"name":"运动指数","title":"较适宜","desc":"天气较好，但考虑风力较强且气温较低，推荐您进行室内运动，若在户外运动请注意防风并适当增减衣物。"},"yh":{"name":"约会指数","title":"较不适宜","desc":"风力较大，建议尽量不要去室外约会，如果外出，请您挑选避风的地点。"},"ys":{"name":"雨伞指数","title":"不带伞","desc":"天气较好，不会降水，因此您可放心出门，无须带雨伞。"},"zs":{"name":"中暑指数","title":"无中暑风险","desc":"天气舒适，令人神清气爽的一天，不用担心中暑的困扰。"},"gl":{"name":"太阳镜指数","title":"必要","desc":"白天太阳辐射较强，建议佩戴透射比1级且标注UV380-UV400的浅色太阳镜"},"rw":{"name":"减肥气象指数","title":"null","desc":"null"},"bl":{"name":"健臻·血糖指数","title":"不易波动","desc":"天气条件不易引起血糖波动。"}},"date":"20191120","week":"三","nongli":"十月廿四","day_air_weather":"多云","night_air_weather":"晴","day_air_temperature":"17","night_air_temperature":"9","day_wind_power":"4-5级","night_wind_power":"3-4级","day_wind_direction":"东风","night_wind_direction":"西风","sun_begin":"06:28","sun_end":"17:00","day_weather_pic":"/day/01.png","night_weather_pic":"/day/00.png","aqi":"50","quality":"优"},{"live":{"ac":{"name":"空调开启指数","title":"较少开启","desc":"您将感到很舒适，一般不需要开启空调。"},"ag":{"name":"过敏指数","title":"极不易发","desc":"天气条件极不易诱发过敏，可放心外出，享受生活。"},"cl":{"name":"晨练指数","title":"较不宜","desc":"风力稍大，较不宜晨练，室外锻炼请注意选择避风的地点，避免迎风锻炼。"},"co":{"name":"舒适度指数","title":"较舒适","desc":"白天天气晴好，早晚会感觉偏凉，午后舒适、宜人。"},"ct":{"name":"穿衣指数","title":"较舒适","desc":"建议着薄外套、开衫牛仔衫裤等服装。年老体弱者应适当添加衣物，宜着夹克衫、薄毛衣等。"},"dy":{"name":"钓鱼指数","title":"较适宜","desc":"较适合垂钓，但风力稍大，会对垂钓产生一定的影响。"},"fs":{"name":"防晒指数","title":"较弱","desc":"紫外线强度较弱，建议涂擦SPF在12-15之间，PA+的防晒护肤品。"},"gj":{"name":"逛街指数","title":"较适宜","desc":"天气较好，在这种天气里去逛街，既可畅快地放松身心，又会有很多意外收获，真是无比惬意。"},"gm":{"name":"感冒指数","title":"少发","desc":"各项气象条件适宜，无明显降温过程，发生感冒机率较低。"},"hc":{"name":"划船指数","title":"较适宜","desc":"白天较适宜划船，但较大的风力会对划船产生一定的影响。"},"jt":{"name":"交通指数","title":"良好","desc":"天气较好，路面干燥，交通气象条件良好，车辆可以正常行驶。"},"lk":{"name":"路况指数","title":"干燥","desc":"天气较好，路面比较干燥，路况较好。"},"ls":{"name":"晾晒指数","title":"适宜","desc":"天气不错，适宜晾晒。赶紧把久未见阳光的衣物搬出来吸收一下太阳的味道吧！"},"mf":{"name":"美发指数","title":"适宜","desc":"气温适宜，但风力较大，这会导致空气中漂浮的尘埃增加，容易弄脏头发，请注意保持头发的清洁，并坚持使用润发露，有效防止头发干燥。　"},"nl":{"name":"夜生活指数","title":"较适宜","desc":"天气较好，虽然有点风，但仍比较适宜夜生活，您可以放心外出。"},"pj":{"name":"啤酒指数","title":"较适宜","desc":"适量的饮用啤酒可能会更增加您舒适的感觉，但要注意千万不要过量呦。"},"pk":{"name":"放风筝指数","title":"较适宜","desc":"温暖舒适，较适宜放风筝。"},"pl":{"name":"空气污染扩散条件指数","title":"良","desc":"气象条件有利于空气污染物稀释、扩散和清除。"},"pp":{"name":"化妆指数","title":"保湿","desc":"风力不大，建议用中性保湿型霜类化妆品，无需选用防晒化妆品。"},"tr":{"name":"旅游指数","title":"适宜","desc":"天气较好，温度适宜，但风稍微有点大。这样的天气适宜旅游，您可以尽情地享受大自然的无限风光。"},"uv":{"name":"紫外线强度指数","title":"弱","desc":"紫外线强度较弱，建议出门前涂擦SPF在12-15之间、PA+的防晒护肤品。"},"wc":{"name":"风寒指数","title":"无","desc":"温度未达到风寒所需的低温，稍作防寒准备即可。"},"xc":{"name":"洗车指数","title":"适宜","desc":"适宜洗车，未来持续两天无雨天气较好，适合擦洗汽车，蓝天白云、风和日丽将伴您的车子连日洁净。"},"xq":{"name":"心情指数","title":"较好","desc":"天气较好，温度适宜，心情会不错，学习、工作效率较高。"},"yd":{"name":"运动指数","title":"较适宜","desc":"天气较好，但因风力稍强，户外可选择对风力要求不高的运动，推荐您进行室内运动。"},"yh":{"name":"约会指数","title":"较适宜","desc":"虽然有点风，但情侣们可以放心外出，不用担心天气来调皮捣乱而影响了兴致。"},"ys":{"name":"雨伞指数","title":"不带伞","desc":"天气较好，不会降水，因此您可放心出门，无须带雨伞。"},"zs":{"name":"中暑指数","title":"无中暑风险","desc":"天气舒适，令人神清气爽的一天，不用担心中暑的困扰。"},"gl":{"name":"太阳镜指数","title":"必要","desc":"白天太阳辐射较强，建议佩戴透射比1级且标注UV380-UV400的浅色太阳镜"},"rw":{"name":"减肥气象指数","title":"null","desc":"null"},"bl":{"name":"健臻·血糖指数","title":"不易波动","desc":"天气条件好，血糖不易波动，可适时进行户外锻炼。"}},"date":"20191121","week":"四","nongli":"十月廿五","day_air_weather":"多云","night_air_weather":"晴","day_air_temperature":"20","night_air_temperature":"10","day_wind_power":"3-4级","night_wind_power":"<3级","day_wind_direction":"西风","night_wind_direction":"微风","sun_begin":"06:29","sun_end":"17:00","day_weather_pic":"/day/01.png","night_weather_pic":"/day/00.png","aqi":"55","quality":"良"},{"live":{"ac":{"name":"空调开启指数","title":"较少开启","desc":"您将感到很舒适，一般不需要开启空调。"},"ag":{"name":"过敏指数","title":"极不易发","desc":"天气条件极不易诱发过敏，可放心外出，享受生活。"},"cl":{"name":"晨练指数","title":"较不宜","desc":"风力稍大，较不宜晨练，室外锻炼请注意选择避风的地点，避免迎风锻炼。"},"co":{"name":"舒适度指数","title":"舒适","desc":"白天不太热也不太冷，风力不大，相信您在这样的天气条件下，应会感到比较清爽和舒适。"},"ct":{"name":"穿衣指数","title":"较舒适","desc":"建议着薄外套、开衫牛仔衫裤等服装。年老体弱者应适当添加衣物，宜着夹克衫、薄毛衣等。"},"dy":{"name":"钓鱼指数","title":"较适宜","desc":"较适合垂钓，但风力稍大，会对垂钓产生一定的影响。"},"fs":{"name":"防晒指数","title":"较弱","desc":"紫外线强度较弱，建议涂擦SPF在12-15之间，PA+的防晒护肤品。"},"gj":{"name":"逛街指数","title":"较适宜","desc":"天气较好，在这种天气里去逛街，既可畅快地放松身心，又会有很多意外收获，真是无比惬意。"},"gm":{"name":"感冒指数","title":"少发","desc":"各项气象条件适宜，无明显降温过程，发生感冒机率较低。"},"hc":{"name":"划船指数","title":"较适宜","desc":"白天较适宜划船，但较大的风力会对划船产生一定的影响。"},"jt":{"name":"交通指数","title":"良好","desc":"天气较好，路面干燥，交通气象条件良好，车辆可以正常行驶。"},"lk":{"name":"路况指数","title":"干燥","desc":"天气较好，路面比较干燥，路况较好。"},"ls":{"name":"晾晒指数","title":"适宜","desc":"天气不错，适宜晾晒。赶紧把久未见阳光的衣物搬出来吸收一下太阳的味道吧！"},"mf":{"name":"美发指数","title":"适宜","desc":"气温适宜，但风力较大，这会导致空气中漂浮的尘埃增加，容易弄脏头发，请注意保持头发的清洁，并坚持使用润发露，有效防止头发干燥。　"},"nl":{"name":"夜生活指数","title":"较适宜","desc":"天气较好，虽然有点风，但仍比较适宜夜生活，您可以放心外出。"},"pj":{"name":"啤酒指数","title":"较适宜","desc":"适量的饮用啤酒可能会更增加您舒适的感觉，但要注意千万不要过量呦。"},"pk":{"name":"放风筝指数","title":"较适宜","desc":"温暖舒适，较适宜放风筝。"},"pl":{"name":"空气污染扩散条件指数","title":"良","desc":"气象条件有利于空气污染物稀释、扩散和清除。"},"pp":{"name":"化妆指数","title":"保湿","desc":"风力不大，建议用中性保湿型霜类化妆品，无需选用防晒化妆品。"},"tr":{"name":"旅游指数","title":"适宜","desc":"天气较好，温度适宜，但风稍微有点大。这样的天气适宜旅游，您可以尽情地享受大自然的无限风光。"},"uv":{"name":"紫外线强度指数","title":"弱","desc":"紫外线强度较弱，建议出门前涂擦SPF在12-15之间、PA+的防晒护肤品。"},"wc":{"name":"风寒指数","title":"无","desc":"温度未达到风寒所需的低温，稍作防寒准备即可。"},"xc":{"name":"洗车指数","title":"适宜","desc":"适宜洗车，未来持续两天无雨天气较好，适合擦洗汽车，蓝天白云、风和日丽将伴您的车子连日洁净。"},"xq":{"name":"心情指数","title":"较好","desc":"天气较好，温度适宜，心情会不错，学习、工作效率较高。"},"yd":{"name":"运动指数","title":"较适宜","desc":"天气较好，但因风力稍强，户外可选择对风力要求不高的运动，推荐您进行室内运动。"},"yh":{"name":"约会指数","title":"较适宜","desc":"虽然有点风，但情侣们可以放心外出，不用担心天气来调皮捣乱而影响了兴致。"},"ys":{"name":"雨伞指数","title":"不带伞","desc":"天气较好，不会降水，因此您可放心出门，无须带雨伞。"},"zs":{"name":"中暑指数","title":"无中暑风险","desc":"天气舒适，令人神清气爽的一天，不用担心中暑的困扰。"},"gl":{"name":"太阳镜指数","title":"必要","desc":"白天太阳辐射较强，建议佩戴透射比1级且标注UV380-UV400的浅色太阳镜"},"rw":{"name":"减肥气象指数","title":"null","desc":"null"},"bl":{"name":"健臻·血糖指数","title":"较易波动","desc":"血糖较易波动，注意监测。"}},"date":"20191122","week":"五","nongli":"十月廿六","day_air_weather":"多云","night_air_weather":"多云","day_air_temperature":"22","night_air_temperature":"12","day_wind_power":"3-4级","night_wind_power":"<3级","day_wind_direction":"西风","night_wind_direction":"微风","sun_begin":"06:30","sun_end":"17:00","day_weather_pic":"/day/01.png","night_weather_pic":"/day/01.png","aqi":"67","quality":"良"},{"live":{"ac":{"name":"空调开启指数","title":"较少开启","desc":"您将感到很舒适，一般不需要开启空调。"},"ag":{"name":"过敏指数","title":"极不易发","desc":"天气条件极不易诱发过敏，可放心外出，享受生活。"},"cl":{"name":"晨练指数","title":"适宜","desc":"天气不错，空气清新，是您晨练的大好时机，建议不同年龄段的人们积极参加户外健身活动。"},"co":{"name":"舒适度指数","title":"舒适","desc":"白天不太热也不太冷，风力不大，相信您在这样的天气条件下，应会感到比较清爽和舒适。"},"ct":{"name":"穿衣指数","title":"舒适","desc":"建议着长袖T恤、衬衫加单裤等服装。年老体弱者宜着针织长袖衬衫、马甲和长裤。"},"dy":{"name":"钓鱼指数","title":"较适宜","desc":"较适合垂钓，但风力稍大，会对垂钓产生一定的影响。"},"fs":{"name":"防晒指数","title":"较弱","desc":"紫外线强度较弱，建议涂擦SPF在12-15之间，PA+的防晒护肤品。"},"gj":{"name":"逛街指数","title":"适宜","desc":"天气较好，在这种天气里去逛街，既可畅快地放松身心，又会有很多意外收获，真是无比惬意。"},"gm":{"name":"感冒指数","title":"较易发","desc":"天气转凉，空气湿度较大，较易发生感冒，体质较弱的朋友请注意适当防护。"},"hc":{"name":"划船指数","title":"适宜","desc":"白天天气较好，适宜划船或嬉玩各种水上运动。"},"jt":{"name":"交通指数","title":"良好","desc":"天气较好，路面干燥，交通气象条件良好，车辆可以正常行驶。"},"lk":{"name":"路况指数","title":"干燥","desc":"天气较好，路面比较干燥，路况较好。"},"ls":{"name":"晾晒指数","title":"适宜","desc":"天气不错，适宜晾晒。赶紧把久未见阳光的衣物搬出来吸收一下太阳的味道吧！"},"mf":{"name":"美发指数","title":"极适宜","desc":"温湿适宜，风力较小，这为您的头发创造一个健康、洁净的生长环境，加上您细心的呵护打理，您的秀发定能飘逸动人。"},"nl":{"name":"夜生活指数","title":"较适宜","desc":"天气较好，虽然有点风，但仍比较适宜夜生活，您可以放心外出。"},"pj":{"name":"啤酒指数","title":"较适宜","desc":"适量的饮用啤酒可能会更增加您舒适的感觉，但要注意千万不要过量呦。"},"pk":{"name":"放风筝指数","title":"较适宜","desc":"温暖舒适，较适宜放风筝。"},"pl":{"name":"空气污染扩散条件指数","title":"中","desc":"气象条件对空气污染物稀释、扩散和清除无明显影响。"},"pp":{"name":"化妆指数","title":"去油","desc":"天气较热，建议用露质面霜打底，水质无油粉底霜，透明粉饼，粉质胭脂。"},"tr":{"name":"旅游指数","title":"适宜","desc":"天气较好，但丝毫不会影响您出行的心情。温度适宜又有微风相伴，适宜旅游。"},"uv":{"name":"紫外线强度指数","title":"弱","desc":"紫外线强度较弱，建议出门前涂擦SPF在12-15之间、PA+的防晒护肤品。"},"wc":{"name":"风寒指数","title":"无","desc":"温度未达到风寒所需的低温，稍作防寒准备即可。"},"xc":{"name":"洗车指数","title":"较适宜","desc":"较适宜洗车，未来一天无雨，风力较小，擦洗一新的汽车至少能保持一天。"},"xq":{"name":"心情指数","title":"较好","desc":"天气较好，温度适宜，心情会不错，学习、工作效率较高。"},"yd":{"name":"运动指数","title":"适宜","desc":"天气较好，赶快投身大自然参与户外运动，尽情感受运动的快乐吧。"},"yh":{"name":"约会指数","title":"较适宜","desc":"虽然有点风，但情侣们可以放心外出，不用担心天气来调皮捣乱而影响了兴致。"},"ys":{"name":"雨伞指数","title":"不带伞","desc":"天气较好，不会降水，因此您可放心出门，无须带雨伞。"},"zs":{"name":"中暑指数","title":"无中暑风险","desc":"天气舒适，令人神清气爽的一天，不用担心中暑的困扰。"},"gl":{"name":"太阳镜指数","title":"很必要","desc":"白天虽有白云遮挡，但太阳辐射仍很强，建议佩戴透射比2级且标注UV400的遮阳镜"},"rw":{"name":"减肥气象指数","title":"null","desc":"null"},"bl":{"name":"健臻·血糖指数","title":"较易波动","desc":"血糖较易波动，注意监测。"}},"date":"20191123","week":"六","nongli":"十月廿七","day_air_weather":"多云","night_air_weather":"多云","day_air_temperature":"25","night_air_temperature":"16","day_wind_power":"<3级","night_wind_power":"<3级","day_wind_direction":"微风","night_wind_direction":"微风","sun_begin":"06:30","sun_end":"16:59","day_weather_pic":"/day/01.png","night_weather_pic":"/day/01.png","aqi":"49","quality":"优"},{"live":{"ac":{"name":"空调开启指数","title":"较少开启","desc":"您将感到很舒适，一般不需要开启空调。"},"ag":{"name":"过敏指数","title":"极不易发","desc":"天气条件极不易诱发过敏，可放心外出，享受生活。"},"cl":{"name":"晨练指数","title":"较不宜","desc":"风力稍大，较不宜晨练，室外锻炼请注意选择避风的地点，避免迎风锻炼。"},"co":{"name":"舒适度指数","title":"舒适","desc":"白天不太热也不太冷，风力不大，相信您在这样的天气条件下，应会感到比较清爽和舒适。"},"ct":{"name":"穿衣指数","title":"舒适","desc":"建议着长袖T恤、衬衫加单裤等服装。年老体弱者宜着针织长袖衬衫、马甲和长裤。"},"dy":{"name":"钓鱼指数","title":"较适宜","desc":"较适合垂钓，但风力稍大，会对垂钓产生一定的影响。"},"fs":{"name":"防晒指数","title":"弱","desc":"属弱紫外辐射天气，长期在户外，建议涂擦SPF在8-12之间的防晒护肤品。"},"gj":{"name":"逛街指数","title":"较不宜","desc":"风力较大，较不适宜逛街，若坚持出门，请选择避风地点。"},"gm":{"name":"感冒指数","title":"较易发","desc":"虽然温度适宜但风力较大，仍较易发生感冒，体质较弱的朋友请注意适当防护。"},"hc":{"name":"划船指数","title":"较适宜","desc":"白天较适宜划船，但较大的风力会对划船产生一定的影响。"},"jt":{"name":"交通指数","title":"良好","desc":"天气较好，路面干燥，交通气象条件良好，车辆可以正常行驶。"},"lk":{"name":"路况指数","title":"干燥","desc":"天气较好，路面比较干燥，路况较好。"},"ls":{"name":"晾晒指数","title":"适宜","desc":"天气不错，适宜晾晒。赶紧把久未见阳光的衣物搬出来吸收一下太阳的味道吧！"},"mf":{"name":"美发指数","title":"适宜","desc":"气温适宜，但风力较大，这会导致空气中漂浮的尘埃增加，容易弄脏头发，请注意保持头发的清洁，并坚持使用润发露，有效防止头发干燥。　"},"nl":{"name":"夜生活指数","title":"较不适宜","desc":"天气较好，但风很大，会影响到您的出行，建议夜生活最好在室内进行。"},"pj":{"name":"啤酒指数","title":"适宜","desc":"炎热的天气可能增加啤酒对您的诱惑，适量饮用啤酒会给您带来清凉的感觉，但千万注意不要过量呦！"},"pk":{"name":"放风筝指数","title":"较适宜","desc":"温暖舒适，较适宜放风筝。"},"pl":{"name":"空气污染扩散条件指数","title":"良","desc":"气象条件有利于空气污染物稀释、扩散和清除。"},"pp":{"name":"化妆指数","title":"去油","desc":"天气较热，建议用露质面霜打底，水质无油粉底霜，透明粉饼，粉质胭脂。"},"tr":{"name":"旅游指数","title":"适宜","desc":"天气较好，温度适宜，但风稍微有点大。这样的天气适宜旅游，您可以尽情地享受大自然的无限风光。"},"uv":{"name":"紫外线强度指数","title":"最弱","desc":"属弱紫外线辐射天气，无需特别防护。若长期在户外，建议涂擦SPF在8-12之间的防晒护肤品。"},"wc":{"name":"风寒指数","title":"无","desc":"温度未达到风寒所需的低温，稍作防寒准备即可。"},"xc":{"name":"洗车指数","title":"不宜","desc":"不宜洗车，未来24小时内有雨，如果在此期间洗车，雨水和路上的泥水可能会再次弄脏您的爱车。"},"xq":{"name":"心情指数","title":"较好","desc":"天气较好，暖阳万丈，温度舒适，您会觉得精神振奋，意气风发，心情舒畅。"},"yd":{"name":"运动指数","title":"较适宜","desc":"天气较好，但因风力稍强，户外可选择对风力要求不高的运动，推荐您进行室内运动。"},"yh":{"name":"约会指数","title":"较不适宜","desc":"风力较大，建议尽量不要去室外约会，如果外出，请您挑选避风的地点。"},"ys":{"name":"雨伞指数","title":"不带伞","desc":"天气较好，不会降水，因此您可放心出门，无须带雨伞。"},"zs":{"name":"中暑指数","title":"无中暑风险","desc":"天气不热，在炎炎夏日中十分难得，可以告别暑气漫漫啦~"},"gl":{"name":"太阳镜指数","title":"很必要","desc":"白天虽有白云遮挡，但太阳辐射仍很强，建议佩戴透射比2级且标注UV400的遮阳镜"},"rw":{"name":"减肥气象指数","title":"null","desc":"null"},"bl":{"name":"健臻·血糖指数","title":"较易波动","desc":"风力较大，血糖较易波动，注意监测。"}},"date":"20191124","week":"日","nongli":"十月廿八","day_air_weather":"多云","night_air_weather":"小雨","day_air_temperature":"27","night_air_temperature":"11","day_wind_power":"4-5级","night_wind_power":"5-6级","day_wind_direction":"西风","night_wind_direction":"北风","sun_begin":"06:31","sun_end":"16:59","day_weather_pic":"/day/01.png","night_weather_pic":"/day/07.png","aqi":"","quality":""},{"live":{"ac":{"name":"空调开启指数","title":"较少开启","desc":"您将感到很舒适，一般不需要开启空调。"},"ag":{"name":"过敏指数","title":"极不易发","desc":"天气条件极不易诱发过敏，可放心外出，享受生活。"},"cl":{"name":"晨练指数","title":"较不宜","desc":"阴天，风力稍大，较不宜晨练，室外锻炼请注意选择避风的地点，避免迎风锻炼。"},"co":{"name":"舒适度指数","title":"很不舒适","desc":"白天天阴风大，且天气凉，在这种天气条件下，会感觉很冷，不舒适，外出不宜过久，并注意防风保暖。"},"ct":{"name":"穿衣指数","title":"冷","desc":"天气冷，建议着棉服、羽绒服、皮夹克加羊毛衫等冬季服装。年老体弱者宜着厚棉衣、冬大衣或厚羽绒服。"},"dy":{"name":"钓鱼指数","title":"不宜","desc":"天气不好，有风，不适合垂钓。"},"fs":{"name":"防晒指数","title":"弱","desc":"属弱紫外辐射天气，长期在户外，建议涂擦SPF在8-12之间的防晒护肤品。"},"gj":{"name":"逛街指数","title":"较不宜","desc":"风力较大，较不适宜逛街，若坚持出门，请选择避风地点。"},"gm":{"name":"感冒指数","title":"极易发","desc":"将有一次强降温过程，且风力较强，极易发生感冒，请特别注意增加衣服保暖防寒。"},"hc":{"name":"划船指数","title":"较适宜","desc":"白天较适宜划船，考虑气温稍低，天气阴沉，风力较大，划船时小心着凉。"},"jt":{"name":"交通指数","title":"良好","desc":"阴天，路面干燥，交通气象条件良好，车辆可以正常行驶。"},"lk":{"name":"路况指数","title":"干燥","desc":"阴天，路面比较干燥，路况较好。"},"ls":{"name":"晾晒指数","title":"不太适宜","desc":"天气阴沉，不利于水分的迅速蒸发，不太适宜晾晒。若需要晾晒，请尽量选择通风的地点。"},"mf":{"name":"美发指数","title":"适宜","desc":"较强的风力不仅易弄脏头发，还会带走头发的水分，以致头发发质变干，失去光泽，请注意保持头发的清洁，使用滋润型洗发露和护发素。"},"nl":{"name":"夜生活指数","title":"较不适宜","desc":"天气阴沉，而且风力很大，会给您的出行带来不便，建议夜生活最好在室内进行。"},"pj":{"name":"啤酒指数","title":"较不适宜","desc":"您将会感到有些凉意，建议饮用常温啤酒，并少量饮用为好。"},"pk":{"name":"放风筝指数","title":"不宜","desc":"天气不好，不适宜放风筝。"},"pl":{"name":"空气污染扩散条件指数","title":"良","desc":"气象条件有利于空气污染物稀释、扩散和清除。"},"pp":{"name":"化妆指数","title":"保湿","desc":"气温较低，风力较大，用滋润型化妆品，少扑粉，用润唇膏后再抹口红。"},"tr":{"name":"旅游指数","title":"适宜","desc":"天气较好，风稍大，但温度适宜，总体来说还是好天气。这样的天气适宜旅游，您可以尽情享受大自然的风光。"},"uv":{"name":"紫外线强度指数","title":"最弱","desc":"属弱紫外线辐射天气，无需特别防护。若长期在户外，建议涂擦SPF在8-12之间的防晒护肤品。"},"wc":{"name":"风寒指数","title":"凉","desc":"风力较大，感觉有点凉，室外活动注意适当增减衣物。"},"xc":{"name":"洗车指数","title":"适宜","desc":"适宜洗车，未来持续两天无雨天气较好，适合擦洗汽车，蓝天白云、风和日丽将伴您的车子连日洁净。"},"xq":{"name":"心情指数","title":"较差","desc":"天气阴沉，会感觉莫名的压抑，情绪低落，此时将所有的悲喜都静静地沉到心底，在喧嚣的尘世里，感受片刻恬淡的宁静。"},"yd":{"name":"运动指数","title":"较不宜","desc":"有降水，且风力较强，推荐您在室内进行各种健身休闲运动；若坚持户外运动，请注意防风保暖。"},"yh":{"name":"约会指数","title":"较不适宜","desc":"阴天且风力较大，建议尽量不要去室外约会，如果外出，请您挑选避风的地点。"},"ys":{"name":"雨伞指数","title":"不带伞","desc":"阴天，但降水概率很低，因此您在出门的时候无须带雨伞。"},"zs":{"name":"中暑指数","title":"无中暑风险","desc":"天气舒适，对易中暑人群来说非常友善。"},"gl":{"name":"太阳镜指数","title":"必要","desc":"白天天空阴沉，但太阳辐射较强，建议佩戴透射比1级且标注UV380-UV400的浅色太阳镜"},"rw":{"name":"减肥气象指数","title":"null","desc":"null"},"bl":{"name":"健臻·血糖指数","title":"易波动","desc":"气温多变，血糖易波动，注意监测血糖变化。"}},"date":"20191125","week":"一","nongli":"十月廿九","day_air_weather":"阴","night_air_weather":"多云","day_air_temperature":"12","night_air_temperature":"6","day_wind_power":"4-5级","night_wind_power":"3-4级","day_wind_direction":"北风","night_wind_direction":"西风","sun_begin":"06:32","sun_end":"16:59","day_weather_pic":"/day/02.png","night_weather_pic":"/day/01.png","aqi":"","quality":""}]
         */

        private CityinfoBean cityinfo;
        private List<Day7Bean> day7;

        public CityinfoBean getCityinfo() {
            return cityinfo;
        }

        public void setCityinfo(CityinfoBean cityinfo) {
            this.cityinfo = cityinfo;
        }

        public List<Day7Bean> getDay7() {
            return day7;
        }

        public void setDay7(List<Day7Bean> day7) {
            this.day7 = day7;
        }

        public static class CityinfoBean {
            /**
             * provinces : 浙江
             * city : 杭州
             * area : 杭州
             * id : 101210101
             * prov_py : zhejiang
             * city_py : hangzhou
             * qh : 0571
             * jb : 2
             * yb : 310000
             * area_py : hangzhou
             * area_short_code : hz
             * lng : 120.153576
             * lat : 30.287459
             */

            private String provinces;
            private String city;
            private String area;
            private String id;
            private String prov_py;
            private String city_py;
            private String qh;
            private String jb;
            private String yb;
            private String area_py;
            private String area_short_code;
            private String lng;
            private String lat;

            public String getProvinces() {
                return provinces;
            }

            public void setProvinces(String provinces) {
                this.provinces = provinces;
            }

            public String getCity() {
                return city;
            }

            public void setCity(String city) {
                this.city = city;
            }

            public String getArea() {
                return area;
            }

            public void setArea(String area) {
                this.area = area;
            }

            public String getId() {
                return id;
            }

            public void setId(String id) {
                this.id = id;
            }

            public String getProv_py() {
                return prov_py;
            }

            public void setProv_py(String prov_py) {
                this.prov_py = prov_py;
            }

            public String getCity_py() {
                return city_py;
            }

            public void setCity_py(String city_py) {
                this.city_py = city_py;
            }

            public String getQh() {
                return qh;
            }

            public void setQh(String qh) {
                this.qh = qh;
            }

            public String getJb() {
                return jb;
            }

            public void setJb(String jb) {
                this.jb = jb;
            }

            public String getYb() {
                return yb;
            }

            public void setYb(String yb) {
                this.yb = yb;
            }

            public String getArea_py() {
                return area_py;
            }

            public void setArea_py(String area_py) {
                this.area_py = area_py;
            }

            public String getArea_short_code() {
                return area_short_code;
            }

            public void setArea_short_code(String area_short_code) {
                this.area_short_code = area_short_code;
            }

            public String getLng() {
                return lng;
            }

            public void setLng(String lng) {
                this.lng = lng;
            }

            public String getLat() {
                return lat;
            }

            public void setLat(String lat) {
                this.lat = lat;
            }
        }

        public static class Day7Bean {
            /**
             * date : 20191119
             * week : 二
             * nongli : 十月廿三
             * day_air_weather : 晴
             * night_air_weather : 晴
             * day_air_temperature : 14
             * night_air_temperature : 7
             * day_wind_power : 3-4级
             * night_wind_power : <3级
             * day_wind_direction : 东北风
             * night_wind_direction : 微风
             * sun_begin : 06:27
             * sun_end : 17:01
             * day_weather_pic : /day/00.png
             * night_weather_pic : /day/00.png
             * aqi : 78
             * quality : 良
             * live : {"ac":{"name":"空调开启指数","title":"较少开启","desc":"您将感到很舒适，一般不需要开启空调。"},"ag":{"name":"过敏指数","title":"极不易发","desc":"天气条件极不易诱发过敏，可放心外出，享受生活。"},"cl":{"name":"晨练指数","title":"较不宜","desc":"风力稍大，较不宜晨练，室外锻炼请注意选择避风的地点，避免迎风锻炼。"},"co":{"name":"舒适度指数","title":"较不舒适","desc":"白天天气晴好，但仍会使您感觉偏冷，不很舒适，请注意适时添加衣物，以防感冒。"},"ct":{"name":"穿衣指数","title":"较冷","desc":"建议着厚外套加毛衣等服装。年老体弱者宜着大衣、呢外套加羊毛衫。"},"dy":{"name":"钓鱼指数","title":"较适宜","desc":"较适合垂钓，但风力稍大，会对垂钓产生一定的影响。"},"fs":{"name":"防晒指数","title":"中等","desc":"属中等强度紫外辐射天气，外出时应注意防护，建议涂擦SPF指数高于15，PA+的防晒护肤品。"},"gj":{"name":"逛街指数","title":"较适宜","desc":"天气较好，在这种天气里去逛街，既可畅快地放松身心，又会有很多意外收获，真是无比惬意。"},"gm":{"name":"感冒指数","title":"少发","desc":"各项气象条件适宜，无明显降温过程，发生感冒机率较低。"},"hc":{"name":"划船指数","title":"较适宜","desc":"白天较适宜划船，但气温稍低，风力较大，划船时注意适当加衣。"},"jt":{"name":"交通指数","title":"良好","desc":"天气较好，路面干燥，交通气象条件良好，车辆可以正常行驶。"},"lk":{"name":"路况指数","title":"干燥","desc":"天气较好，路面比较干燥，路况较好。"},"ls":{"name":"晾晒指数","title":"基本适宜","desc":"天气不错，午后温暖的阳光仍能满足你驱潮消霉杀菌的晾晒需求。"},"mf":{"name":"美发指数","title":"适宜","desc":"风大，这种天气会带走头发的水分并易弄脏头发，以致头发发涩，失去光泽，请使用含防晒和滋润成分的洗发护发品。"},"nl":{"name":"夜生活指数","title":"较适宜","desc":"天气较好，虽然有点风，比较适宜夜生活，您可以放心外出。"},"pj":{"name":"啤酒指数","title":"较不适宜","desc":"您将会感到有些凉意，建议饮用常温啤酒，并少量饮用为好。"},"pk":{"name":"放风筝指数","title":"适宜","desc":"天气不错，这种天气去放风筝既可以舒展筋骨，又可放松身心，超然自逸于广袤的天地之间。"},"pl":{"name":"空气污染扩散条件指数","title":"良","desc":"气象条件有利于空气污染物稀释、扩散和清除。"},"pp":{"name":"化妆指数","title":"保湿","desc":"皮肤易缺水，用润唇膏后再抹口红，用保湿型霜类化妆品。"},"tr":{"name":"旅游指数","title":"适宜","desc":"天气较好，风稍大，但温度适宜，是个好天气哦。适宜旅游，您可以尽情地享受大自然的无限风光。"},"uv":{"name":"紫外线强度指数","title":"中等","desc":"属中等强度紫外线辐射天气，外出时建议涂擦SPF高于15、PA+的防晒护肤品，戴帽子、太阳镜。"},"wc":{"name":"风寒指数","title":"凉","desc":"感觉有点凉，室外活动注意适当增减衣物。"},"xc":{"name":"洗车指数","title":"适宜","desc":"适宜洗车，未来持续两天无雨天气较好，适合擦洗汽车，蓝天白云、风和日丽将伴您的车子连日洁净。"},"xq":{"name":"心情指数","title":"好","desc":"天气较好，空气温润，和风飘飘，美好的天气会带来一天接踵而来的好心情。"},"yd":{"name":"运动指数","title":"较适宜","desc":"天气较好，但考虑风力较强且气温较低，推荐您进行室内运动，若在户外运动注意防风并适当增减衣物。"},"yh":{"name":"约会指数","title":"较适宜","desc":"虽然有点风，但情侣们可以放心外出，不用担心天气来调皮捣乱而影响了兴致。"},"ys":{"name":"雨伞指数","title":"不带伞","desc":"天气较好，您在出门的时候无须带雨伞。"},"zs":{"name":"中暑指数","title":"无中暑风险","desc":"天气不热，在炎炎夏日中十分难得，可以告别暑气漫漫啦~"},"gl":{"name":"太阳镜指数","title":"必要","desc":"白天天气晴朗，太阳辐射较强，建议佩戴透射比1级且标注UV380-UV400的遮阳镜"},"rw":{"name":"减肥气象指数","title":"null","desc":"null"},"bl":{"name":"健臻·血糖指数","title":"不易波动","desc":"天气条件好，血糖不易波动，可适时进行户外锻炼。"}}
             */

            private String date;
            private String week;
            private String nongli;
            private String day_air_weather;
            private String night_air_weather;
            private String day_air_temperature;
            private String night_air_temperature;
            private String day_wind_power;
            private String night_wind_power;
            private String day_wind_direction;
            private String night_wind_direction;
            private String sun_begin;
            private String sun_end;
            private String day_weather_pic;
            private String night_weather_pic;
            private String aqi;
            private String quality;
            private LiveBean live;

            public String getDate() {
                return date;
            }

            public void setDate(String date) {
                this.date = date;
            }

            public String getWeek() {
                return week;
            }

            public void setWeek(String week) {
                this.week = week;
            }

            public String getNongli() {
                return nongli;
            }

            public void setNongli(String nongli) {
                this.nongli = nongli;
            }

            public String getDay_air_weather() {
                return day_air_weather;
            }

            public void setDay_air_weather(String day_air_weather) {
                this.day_air_weather = day_air_weather;
            }

            public String getNight_air_weather() {
                return night_air_weather;
            }

            public void setNight_air_weather(String night_air_weather) {
                this.night_air_weather = night_air_weather;
            }

            public String getDay_air_temperature() {
                return day_air_temperature;
            }

            public void setDay_air_temperature(String day_air_temperature) {
                this.day_air_temperature = day_air_temperature;
            }

            public String getNight_air_temperature() {
                return night_air_temperature;
            }

            public void setNight_air_temperature(String night_air_temperature) {
                this.night_air_temperature = night_air_temperature;
            }

            public String getDay_wind_power() {
                return day_wind_power;
            }

            public void setDay_wind_power(String day_wind_power) {
                this.day_wind_power = day_wind_power;
            }

            public String getNight_wind_power() {
                return night_wind_power;
            }

            public void setNight_wind_power(String night_wind_power) {
                this.night_wind_power = night_wind_power;
            }

            public String getDay_wind_direction() {
                return day_wind_direction;
            }

            public void setDay_wind_direction(String day_wind_direction) {
                this.day_wind_direction = day_wind_direction;
            }

            public String getNight_wind_direction() {
                return night_wind_direction;
            }

            public void setNight_wind_direction(String night_wind_direction) {
                this.night_wind_direction = night_wind_direction;
            }

            public String getSun_begin() {
                return sun_begin;
            }

            public void setSun_begin(String sun_begin) {
                this.sun_begin = sun_begin;
            }

            public String getSun_end() {
                return sun_end;
            }

            public void setSun_end(String sun_end) {
                this.sun_end = sun_end;
            }

            public String getDay_weather_pic() {
                return day_weather_pic;
            }

            public void setDay_weather_pic(String day_weather_pic) {
                this.day_weather_pic = day_weather_pic;
            }

            public String getNight_weather_pic() {
                return night_weather_pic;
            }

            public void setNight_weather_pic(String night_weather_pic) {
                this.night_weather_pic = night_weather_pic;
            }

            public String getAqi() {
                return aqi;
            }

            public void setAqi(String aqi) {
                this.aqi = aqi;
            }

            public String getQuality() {
                return quality;
            }

            public void setQuality(String quality) {
                this.quality = quality;
            }

            public LiveBean getLive() {
                return live;
            }

            public void setLive(LiveBean live) {
                this.live = live;
            }

            public static class LiveBean {
                /**
                 * ac : {"name":"空调开启指数","title":"较少开启","desc":"您将感到很舒适，一般不需要开启空调。"}
                 * ag : {"name":"过敏指数","title":"极不易发","desc":"天气条件极不易诱发过敏，可放心外出，享受生活。"}
                 * cl : {"name":"晨练指数","title":"较不宜","desc":"风力稍大，较不宜晨练，室外锻炼请注意选择避风的地点，避免迎风锻炼。"}
                 * co : {"name":"舒适度指数","title":"较不舒适","desc":"白天天气晴好，但仍会使您感觉偏冷，不很舒适，请注意适时添加衣物，以防感冒。"}
                 * ct : {"name":"穿衣指数","title":"较冷","desc":"建议着厚外套加毛衣等服装。年老体弱者宜着大衣、呢外套加羊毛衫。"}
                 * dy : {"name":"钓鱼指数","title":"较适宜","desc":"较适合垂钓，但风力稍大，会对垂钓产生一定的影响。"}
                 * fs : {"name":"防晒指数","title":"中等","desc":"属中等强度紫外辐射天气，外出时应注意防护，建议涂擦SPF指数高于15，PA+的防晒护肤品。"}
                 * gj : {"name":"逛街指数","title":"较适宜","desc":"天气较好，在这种天气里去逛街，既可畅快地放松身心，又会有很多意外收获，真是无比惬意。"}
                 * gm : {"name":"感冒指数","title":"少发","desc":"各项气象条件适宜，无明显降温过程，发生感冒机率较低。"}
                 * hc : {"name":"划船指数","title":"较适宜","desc":"白天较适宜划船，但气温稍低，风力较大，划船时注意适当加衣。"}
                 * jt : {"name":"交通指数","title":"良好","desc":"天气较好，路面干燥，交通气象条件良好，车辆可以正常行驶。"}
                 * lk : {"name":"路况指数","title":"干燥","desc":"天气较好，路面比较干燥，路况较好。"}
                 * ls : {"name":"晾晒指数","title":"基本适宜","desc":"天气不错，午后温暖的阳光仍能满足你驱潮消霉杀菌的晾晒需求。"}
                 * mf : {"name":"美发指数","title":"适宜","desc":"风大，这种天气会带走头发的水分并易弄脏头发，以致头发发涩，失去光泽，请使用含防晒和滋润成分的洗发护发品。"}
                 * nl : {"name":"夜生活指数","title":"较适宜","desc":"天气较好，虽然有点风，比较适宜夜生活，您可以放心外出。"}
                 * pj : {"name":"啤酒指数","title":"较不适宜","desc":"您将会感到有些凉意，建议饮用常温啤酒，并少量饮用为好。"}
                 * pk : {"name":"放风筝指数","title":"适宜","desc":"天气不错，这种天气去放风筝既可以舒展筋骨，又可放松身心，超然自逸于广袤的天地之间。"}
                 * pl : {"name":"空气污染扩散条件指数","title":"良","desc":"气象条件有利于空气污染物稀释、扩散和清除。"}
                 * pp : {"name":"化妆指数","title":"保湿","desc":"皮肤易缺水，用润唇膏后再抹口红，用保湿型霜类化妆品。"}
                 * tr : {"name":"旅游指数","title":"适宜","desc":"天气较好，风稍大，但温度适宜，是个好天气哦。适宜旅游，您可以尽情地享受大自然的无限风光。"}
                 * uv : {"name":"紫外线强度指数","title":"中等","desc":"属中等强度紫外线辐射天气，外出时建议涂擦SPF高于15、PA+的防晒护肤品，戴帽子、太阳镜。"}
                 * wc : {"name":"风寒指数","title":"凉","desc":"感觉有点凉，室外活动注意适当增减衣物。"}
                 * xc : {"name":"洗车指数","title":"适宜","desc":"适宜洗车，未来持续两天无雨天气较好，适合擦洗汽车，蓝天白云、风和日丽将伴您的车子连日洁净。"}
                 * xq : {"name":"心情指数","title":"好","desc":"天气较好，空气温润，和风飘飘，美好的天气会带来一天接踵而来的好心情。"}
                 * yd : {"name":"运动指数","title":"较适宜","desc":"天气较好，但考虑风力较强且气温较低，推荐您进行室内运动，若在户外运动注意防风并适当增减衣物。"}
                 * yh : {"name":"约会指数","title":"较适宜","desc":"虽然有点风，但情侣们可以放心外出，不用担心天气来调皮捣乱而影响了兴致。"}
                 * ys : {"name":"雨伞指数","title":"不带伞","desc":"天气较好，您在出门的时候无须带雨伞。"}
                 * zs : {"name":"中暑指数","title":"无中暑风险","desc":"天气不热，在炎炎夏日中十分难得，可以告别暑气漫漫啦~"}
                 * gl : {"name":"太阳镜指数","title":"必要","desc":"白天天气晴朗，太阳辐射较强，建议佩戴透射比1级且标注UV380-UV400的遮阳镜"}
                 * rw : {"name":"减肥气象指数","title":"null","desc":"null"}
                 * bl : {"name":"健臻·血糖指数","title":"不易波动","desc":"天气条件好，血糖不易波动，可适时进行户外锻炼。"}
                 */

                private AcBean ac;
                private AgBean ag;
                private ClBean cl;
                private CoBean co;
                private CtBean ct;
                private DyBean dy;
                private FsBean fs;
                private GjBean gj;
                private GmBean gm;
                private HcBean hc;
                private JtBean jt;
                private LkBean lk;
                private LsBean ls;
                private MfBean mf;
                private NlBean nl;
                private PjBean pj;
                private PkBean pk;
                private PlBean pl;
                private PpBean pp;
                private TrBean tr;
                private UvBean uv;
                private WcBean wc;
                private XcBean xc;
                private XqBean xq;
                private YdBean yd;
                private YhBean yh;
                private YsBean ys;
                private ZsBean zs;
                private GlBean gl;
                private RwBean rw;
                private BlBean bl;

                public AcBean getAc() {
                    return ac;
                }

                public void setAc(AcBean ac) {
                    this.ac = ac;
                }

                public AgBean getAg() {
                    return ag;
                }

                public void setAg(AgBean ag) {
                    this.ag = ag;
                }

                public ClBean getCl() {
                    return cl;
                }

                public void setCl(ClBean cl) {
                    this.cl = cl;
                }

                public CoBean getCo() {
                    return co;
                }

                public void setCo(CoBean co) {
                    this.co = co;
                }

                public CtBean getCt() {
                    return ct;
                }

                public void setCt(CtBean ct) {
                    this.ct = ct;
                }

                public DyBean getDy() {
                    return dy;
                }

                public void setDy(DyBean dy) {
                    this.dy = dy;
                }

                public FsBean getFs() {
                    return fs;
                }

                public void setFs(FsBean fs) {
                    this.fs = fs;
                }

                public GjBean getGj() {
                    return gj;
                }

                public void setGj(GjBean gj) {
                    this.gj = gj;
                }

                public GmBean getGm() {
                    return gm;
                }

                public void setGm(GmBean gm) {
                    this.gm = gm;
                }

                public HcBean getHc() {
                    return hc;
                }

                public void setHc(HcBean hc) {
                    this.hc = hc;
                }

                public JtBean getJt() {
                    return jt;
                }

                public void setJt(JtBean jt) {
                    this.jt = jt;
                }

                public LkBean getLk() {
                    return lk;
                }

                public void setLk(LkBean lk) {
                    this.lk = lk;
                }

                public LsBean getLs() {
                    return ls;
                }

                public void setLs(LsBean ls) {
                    this.ls = ls;
                }

                public MfBean getMf() {
                    return mf;
                }

                public void setMf(MfBean mf) {
                    this.mf = mf;
                }

                public NlBean getNl() {
                    return nl;
                }

                public void setNl(NlBean nl) {
                    this.nl = nl;
                }

                public PjBean getPj() {
                    return pj;
                }

                public void setPj(PjBean pj) {
                    this.pj = pj;
                }

                public PkBean getPk() {
                    return pk;
                }

                public void setPk(PkBean pk) {
                    this.pk = pk;
                }

                public PlBean getPl() {
                    return pl;
                }

                public void setPl(PlBean pl) {
                    this.pl = pl;
                }

                public PpBean getPp() {
                    return pp;
                }

                public void setPp(PpBean pp) {
                    this.pp = pp;
                }

                public TrBean getTr() {
                    return tr;
                }

                public void setTr(TrBean tr) {
                    this.tr = tr;
                }

                public UvBean getUv() {
                    return uv;
                }

                public void setUv(UvBean uv) {
                    this.uv = uv;
                }

                public WcBean getWc() {
                    return wc;
                }

                public void setWc(WcBean wc) {
                    this.wc = wc;
                }

                public XcBean getXc() {
                    return xc;
                }

                public void setXc(XcBean xc) {
                    this.xc = xc;
                }

                public XqBean getXq() {
                    return xq;
                }

                public void setXq(XqBean xq) {
                    this.xq = xq;
                }

                public YdBean getYd() {
                    return yd;
                }

                public void setYd(YdBean yd) {
                    this.yd = yd;
                }

                public YhBean getYh() {
                    return yh;
                }

                public void setYh(YhBean yh) {
                    this.yh = yh;
                }

                public YsBean getYs() {
                    return ys;
                }

                public void setYs(YsBean ys) {
                    this.ys = ys;
                }

                public ZsBean getZs() {
                    return zs;
                }

                public void setZs(ZsBean zs) {
                    this.zs = zs;
                }

                public GlBean getGl() {
                    return gl;
                }

                public void setGl(GlBean gl) {
                    this.gl = gl;
                }

                public RwBean getRw() {
                    return rw;
                }

                public void setRw(RwBean rw) {
                    this.rw = rw;
                }

                public BlBean getBl() {
                    return bl;
                }

                public void setBl(BlBean bl) {
                    this.bl = bl;
                }

                public static class AcBean {
                    /**
                     * name : 空调开启指数
                     * title : 较少开启
                     * desc : 您将感到很舒适，一般不需要开启空调。
                     */

                    private String name;
                    private String title;
                    private String desc;

                    public String getName() {
                        return name;
                    }

                    public void setName(String name) {
                        this.name = name;
                    }

                    public String getTitle() {
                        return title;
                    }

                    public void setTitle(String title) {
                        this.title = title;
                    }

                    public String getDesc() {
                        return desc;
                    }

                    public void setDesc(String desc) {
                        this.desc = desc;
                    }
                }

                public static class AgBean {
                    /**
                     * name : 过敏指数
                     * title : 极不易发
                     * desc : 天气条件极不易诱发过敏，可放心外出，享受生活。
                     */

                    private String name;
                    private String title;
                    private String desc;

                    public String getName() {
                        return name;
                    }

                    public void setName(String name) {
                        this.name = name;
                    }

                    public String getTitle() {
                        return title;
                    }

                    public void setTitle(String title) {
                        this.title = title;
                    }

                    public String getDesc() {
                        return desc;
                    }

                    public void setDesc(String desc) {
                        this.desc = desc;
                    }
                }

                public static class ClBean {
                    /**
                     * name : 晨练指数
                     * title : 较不宜
                     * desc : 风力稍大，较不宜晨练，室外锻炼请注意选择避风的地点，避免迎风锻炼。
                     */

                    private String name;
                    private String title;
                    private String desc;

                    public String getName() {
                        return name;
                    }

                    public void setName(String name) {
                        this.name = name;
                    }

                    public String getTitle() {
                        return title;
                    }

                    public void setTitle(String title) {
                        this.title = title;
                    }

                    public String getDesc() {
                        return desc;
                    }

                    public void setDesc(String desc) {
                        this.desc = desc;
                    }
                }

                public static class CoBean {
                    /**
                     * name : 舒适度指数
                     * title : 较不舒适
                     * desc : 白天天气晴好，但仍会使您感觉偏冷，不很舒适，请注意适时添加衣物，以防感冒。
                     */

                    private String name;
                    private String title;
                    private String desc;

                    public String getName() {
                        return name;
                    }

                    public void setName(String name) {
                        this.name = name;
                    }

                    public String getTitle() {
                        return title;
                    }

                    public void setTitle(String title) {
                        this.title = title;
                    }

                    public String getDesc() {
                        return desc;
                    }

                    public void setDesc(String desc) {
                        this.desc = desc;
                    }
                }

                public static class CtBean {
                    /**
                     * name : 穿衣指数
                     * title : 较冷
                     * desc : 建议着厚外套加毛衣等服装。年老体弱者宜着大衣、呢外套加羊毛衫。
                     */

                    private String name;
                    private String title;
                    private String desc;

                    public String getName() {
                        return name;
                    }

                    public void setName(String name) {
                        this.name = name;
                    }

                    public String getTitle() {
                        return title;
                    }

                    public void setTitle(String title) {
                        this.title = title;
                    }

                    public String getDesc() {
                        return desc;
                    }

                    public void setDesc(String desc) {
                        this.desc = desc;
                    }
                }

                public static class DyBean {
                    /**
                     * name : 钓鱼指数
                     * title : 较适宜
                     * desc : 较适合垂钓，但风力稍大，会对垂钓产生一定的影响。
                     */

                    private String name;
                    private String title;
                    private String desc;

                    public String getName() {
                        return name;
                    }

                    public void setName(String name) {
                        this.name = name;
                    }

                    public String getTitle() {
                        return title;
                    }

                    public void setTitle(String title) {
                        this.title = title;
                    }

                    public String getDesc() {
                        return desc;
                    }

                    public void setDesc(String desc) {
                        this.desc = desc;
                    }
                }

                public static class FsBean {
                    /**
                     * name : 防晒指数
                     * title : 中等
                     * desc : 属中等强度紫外辐射天气，外出时应注意防护，建议涂擦SPF指数高于15，PA+的防晒护肤品。
                     */

                    private String name;
                    private String title;
                    private String desc;

                    public String getName() {
                        return name;
                    }

                    public void setName(String name) {
                        this.name = name;
                    }

                    public String getTitle() {
                        return title;
                    }

                    public void setTitle(String title) {
                        this.title = title;
                    }

                    public String getDesc() {
                        return desc;
                    }

                    public void setDesc(String desc) {
                        this.desc = desc;
                    }
                }

                public static class GjBean {
                    /**
                     * name : 逛街指数
                     * title : 较适宜
                     * desc : 天气较好，在这种天气里去逛街，既可畅快地放松身心，又会有很多意外收获，真是无比惬意。
                     */

                    private String name;
                    private String title;
                    private String desc;

                    public String getName() {
                        return name;
                    }

                    public void setName(String name) {
                        this.name = name;
                    }

                    public String getTitle() {
                        return title;
                    }

                    public void setTitle(String title) {
                        this.title = title;
                    }

                    public String getDesc() {
                        return desc;
                    }

                    public void setDesc(String desc) {
                        this.desc = desc;
                    }
                }

                public static class GmBean {
                    /**
                     * name : 感冒指数
                     * title : 少发
                     * desc : 各项气象条件适宜，无明显降温过程，发生感冒机率较低。
                     */

                    private String name;
                    private String title;
                    private String desc;

                    public String getName() {
                        return name;
                    }

                    public void setName(String name) {
                        this.name = name;
                    }

                    public String getTitle() {
                        return title;
                    }

                    public void setTitle(String title) {
                        this.title = title;
                    }

                    public String getDesc() {
                        return desc;
                    }

                    public void setDesc(String desc) {
                        this.desc = desc;
                    }
                }

                public static class HcBean {
                    /**
                     * name : 划船指数
                     * title : 较适宜
                     * desc : 白天较适宜划船，但气温稍低，风力较大，划船时注意适当加衣。
                     */

                    private String name;
                    private String title;
                    private String desc;

                    public String getName() {
                        return name;
                    }

                    public void setName(String name) {
                        this.name = name;
                    }

                    public String getTitle() {
                        return title;
                    }

                    public void setTitle(String title) {
                        this.title = title;
                    }

                    public String getDesc() {
                        return desc;
                    }

                    public void setDesc(String desc) {
                        this.desc = desc;
                    }
                }

                public static class JtBean {
                    /**
                     * name : 交通指数
                     * title : 良好
                     * desc : 天气较好，路面干燥，交通气象条件良好，车辆可以正常行驶。
                     */

                    private String name;
                    private String title;
                    private String desc;

                    public String getName() {
                        return name;
                    }

                    public void setName(String name) {
                        this.name = name;
                    }

                    public String getTitle() {
                        return title;
                    }

                    public void setTitle(String title) {
                        this.title = title;
                    }

                    public String getDesc() {
                        return desc;
                    }

                    public void setDesc(String desc) {
                        this.desc = desc;
                    }
                }

                public static class LkBean {
                    /**
                     * name : 路况指数
                     * title : 干燥
                     * desc : 天气较好，路面比较干燥，路况较好。
                     */

                    private String name;
                    private String title;
                    private String desc;

                    public String getName() {
                        return name;
                    }

                    public void setName(String name) {
                        this.name = name;
                    }

                    public String getTitle() {
                        return title;
                    }

                    public void setTitle(String title) {
                        this.title = title;
                    }

                    public String getDesc() {
                        return desc;
                    }

                    public void setDesc(String desc) {
                        this.desc = desc;
                    }
                }

                public static class LsBean {
                    /**
                     * name : 晾晒指数
                     * title : 基本适宜
                     * desc : 天气不错，午后温暖的阳光仍能满足你驱潮消霉杀菌的晾晒需求。
                     */

                    private String name;
                    private String title;
                    private String desc;

                    public String getName() {
                        return name;
                    }

                    public void setName(String name) {
                        this.name = name;
                    }

                    public String getTitle() {
                        return title;
                    }

                    public void setTitle(String title) {
                        this.title = title;
                    }

                    public String getDesc() {
                        return desc;
                    }

                    public void setDesc(String desc) {
                        this.desc = desc;
                    }
                }

                public static class MfBean {
                    /**
                     * name : 美发指数
                     * title : 适宜
                     * desc : 风大，这种天气会带走头发的水分并易弄脏头发，以致头发发涩，失去光泽，请使用含防晒和滋润成分的洗发护发品。
                     */

                    private String name;
                    private String title;
                    private String desc;

                    public String getName() {
                        return name;
                    }

                    public void setName(String name) {
                        this.name = name;
                    }

                    public String getTitle() {
                        return title;
                    }

                    public void setTitle(String title) {
                        this.title = title;
                    }

                    public String getDesc() {
                        return desc;
                    }

                    public void setDesc(String desc) {
                        this.desc = desc;
                    }
                }

                public static class NlBean {
                    /**
                     * name : 夜生活指数
                     * title : 较适宜
                     * desc : 天气较好，虽然有点风，比较适宜夜生活，您可以放心外出。
                     */

                    private String name;
                    private String title;
                    private String desc;

                    public String getName() {
                        return name;
                    }

                    public void setName(String name) {
                        this.name = name;
                    }

                    public String getTitle() {
                        return title;
                    }

                    public void setTitle(String title) {
                        this.title = title;
                    }

                    public String getDesc() {
                        return desc;
                    }

                    public void setDesc(String desc) {
                        this.desc = desc;
                    }
                }

                public static class PjBean {
                    /**
                     * name : 啤酒指数
                     * title : 较不适宜
                     * desc : 您将会感到有些凉意，建议饮用常温啤酒，并少量饮用为好。
                     */

                    private String name;
                    private String title;
                    private String desc;

                    public String getName() {
                        return name;
                    }

                    public void setName(String name) {
                        this.name = name;
                    }

                    public String getTitle() {
                        return title;
                    }

                    public void setTitle(String title) {
                        this.title = title;
                    }

                    public String getDesc() {
                        return desc;
                    }

                    public void setDesc(String desc) {
                        this.desc = desc;
                    }
                }

                public static class PkBean {
                    /**
                     * name : 放风筝指数
                     * title : 适宜
                     * desc : 天气不错，这种天气去放风筝既可以舒展筋骨，又可放松身心，超然自逸于广袤的天地之间。
                     */

                    private String name;
                    private String title;
                    private String desc;

                    public String getName() {
                        return name;
                    }

                    public void setName(String name) {
                        this.name = name;
                    }

                    public String getTitle() {
                        return title;
                    }

                    public void setTitle(String title) {
                        this.title = title;
                    }

                    public String getDesc() {
                        return desc;
                    }

                    public void setDesc(String desc) {
                        this.desc = desc;
                    }
                }

                public static class PlBean {
                    /**
                     * name : 空气污染扩散条件指数
                     * title : 良
                     * desc : 气象条件有利于空气污染物稀释、扩散和清除。
                     */

                    private String name;
                    private String title;
                    private String desc;

                    public String getName() {
                        return name;
                    }

                    public void setName(String name) {
                        this.name = name;
                    }

                    public String getTitle() {
                        return title;
                    }

                    public void setTitle(String title) {
                        this.title = title;
                    }

                    public String getDesc() {
                        return desc;
                    }

                    public void setDesc(String desc) {
                        this.desc = desc;
                    }
                }

                public static class PpBean {
                    /**
                     * name : 化妆指数
                     * title : 保湿
                     * desc : 皮肤易缺水，用润唇膏后再抹口红，用保湿型霜类化妆品。
                     */

                    private String name;
                    private String title;
                    private String desc;

                    public String getName() {
                        return name;
                    }

                    public void setName(String name) {
                        this.name = name;
                    }

                    public String getTitle() {
                        return title;
                    }

                    public void setTitle(String title) {
                        this.title = title;
                    }

                    public String getDesc() {
                        return desc;
                    }

                    public void setDesc(String desc) {
                        this.desc = desc;
                    }
                }

                public static class TrBean {
                    /**
                     * name : 旅游指数
                     * title : 适宜
                     * desc : 天气较好，风稍大，但温度适宜，是个好天气哦。适宜旅游，您可以尽情地享受大自然的无限风光。
                     */

                    private String name;
                    private String title;
                    private String desc;

                    public String getName() {
                        return name;
                    }

                    public void setName(String name) {
                        this.name = name;
                    }

                    public String getTitle() {
                        return title;
                    }

                    public void setTitle(String title) {
                        this.title = title;
                    }

                    public String getDesc() {
                        return desc;
                    }

                    public void setDesc(String desc) {
                        this.desc = desc;
                    }
                }

                public static class UvBean {
                    /**
                     * name : 紫外线强度指数
                     * title : 中等
                     * desc : 属中等强度紫外线辐射天气，外出时建议涂擦SPF高于15、PA+的防晒护肤品，戴帽子、太阳镜。
                     */

                    private String name;
                    private String title;
                    private String desc;

                    public String getName() {
                        return name;
                    }

                    public void setName(String name) {
                        this.name = name;
                    }

                    public String getTitle() {
                        return title;
                    }

                    public void setTitle(String title) {
                        this.title = title;
                    }

                    public String getDesc() {
                        return desc;
                    }

                    public void setDesc(String desc) {
                        this.desc = desc;
                    }
                }

                public static class WcBean {
                    /**
                     * name : 风寒指数
                     * title : 凉
                     * desc : 感觉有点凉，室外活动注意适当增减衣物。
                     */

                    private String name;
                    private String title;
                    private String desc;

                    public String getName() {
                        return name;
                    }

                    public void setName(String name) {
                        this.name = name;
                    }

                    public String getTitle() {
                        return title;
                    }

                    public void setTitle(String title) {
                        this.title = title;
                    }

                    public String getDesc() {
                        return desc;
                    }

                    public void setDesc(String desc) {
                        this.desc = desc;
                    }
                }

                public static class XcBean {
                    /**
                     * name : 洗车指数
                     * title : 适宜
                     * desc : 适宜洗车，未来持续两天无雨天气较好，适合擦洗汽车，蓝天白云、风和日丽将伴您的车子连日洁净。
                     */

                    private String name;
                    private String title;
                    private String desc;

                    public String getName() {
                        return name;
                    }

                    public void setName(String name) {
                        this.name = name;
                    }

                    public String getTitle() {
                        return title;
                    }

                    public void setTitle(String title) {
                        this.title = title;
                    }

                    public String getDesc() {
                        return desc;
                    }

                    public void setDesc(String desc) {
                        this.desc = desc;
                    }
                }

                public static class XqBean {
                    /**
                     * name : 心情指数
                     * title : 好
                     * desc : 天气较好，空气温润，和风飘飘，美好的天气会带来一天接踵而来的好心情。
                     */

                    private String name;
                    private String title;
                    private String desc;

                    public String getName() {
                        return name;
                    }

                    public void setName(String name) {
                        this.name = name;
                    }

                    public String getTitle() {
                        return title;
                    }

                    public void setTitle(String title) {
                        this.title = title;
                    }

                    public String getDesc() {
                        return desc;
                    }

                    public void setDesc(String desc) {
                        this.desc = desc;
                    }
                }

                public static class YdBean {
                    /**
                     * name : 运动指数
                     * title : 较适宜
                     * desc : 天气较好，但考虑风力较强且气温较低，推荐您进行室内运动，若在户外运动注意防风并适当增减衣物。
                     */

                    private String name;
                    private String title;
                    private String desc;

                    public String getName() {
                        return name;
                    }

                    public void setName(String name) {
                        this.name = name;
                    }

                    public String getTitle() {
                        return title;
                    }

                    public void setTitle(String title) {
                        this.title = title;
                    }

                    public String getDesc() {
                        return desc;
                    }

                    public void setDesc(String desc) {
                        this.desc = desc;
                    }
                }

                public static class YhBean {
                    /**
                     * name : 约会指数
                     * title : 较适宜
                     * desc : 虽然有点风，但情侣们可以放心外出，不用担心天气来调皮捣乱而影响了兴致。
                     */

                    private String name;
                    private String title;
                    private String desc;

                    public String getName() {
                        return name;
                    }

                    public void setName(String name) {
                        this.name = name;
                    }

                    public String getTitle() {
                        return title;
                    }

                    public void setTitle(String title) {
                        this.title = title;
                    }

                    public String getDesc() {
                        return desc;
                    }

                    public void setDesc(String desc) {
                        this.desc = desc;
                    }
                }

                public static class YsBean {
                    /**
                     * name : 雨伞指数
                     * title : 不带伞
                     * desc : 天气较好，您在出门的时候无须带雨伞。
                     */

                    private String name;
                    private String title;
                    private String desc;

                    public String getName() {
                        return name;
                    }

                    public void setName(String name) {
                        this.name = name;
                    }

                    public String getTitle() {
                        return title;
                    }

                    public void setTitle(String title) {
                        this.title = title;
                    }

                    public String getDesc() {
                        return desc;
                    }

                    public void setDesc(String desc) {
                        this.desc = desc;
                    }
                }

                public static class ZsBean {
                    /**
                     * name : 中暑指数
                     * title : 无中暑风险
                     * desc : 天气不热，在炎炎夏日中十分难得，可以告别暑气漫漫啦~
                     */

                    private String name;
                    private String title;
                    private String desc;

                    public String getName() {
                        return name;
                    }

                    public void setName(String name) {
                        this.name = name;
                    }

                    public String getTitle() {
                        return title;
                    }

                    public void setTitle(String title) {
                        this.title = title;
                    }

                    public String getDesc() {
                        return desc;
                    }

                    public void setDesc(String desc) {
                        this.desc = desc;
                    }
                }

                public static class GlBean {
                    /**
                     * name : 太阳镜指数
                     * title : 必要
                     * desc : 白天天气晴朗，太阳辐射较强，建议佩戴透射比1级且标注UV380-UV400的遮阳镜
                     */

                    private String name;
                    private String title;
                    private String desc;

                    public String getName() {
                        return name;
                    }

                    public void setName(String name) {
                        this.name = name;
                    }

                    public String getTitle() {
                        return title;
                    }

                    public void setTitle(String title) {
                        this.title = title;
                    }

                    public String getDesc() {
                        return desc;
                    }

                    public void setDesc(String desc) {
                        this.desc = desc;
                    }
                }

                public static class RwBean {
                    /**
                     * name : 减肥气象指数
                     * title : null
                     * desc : null
                     */

                    private String name;
                    private String title;
                    private String desc;

                    public String getName() {
                        return name;
                    }

                    public void setName(String name) {
                        this.name = name;
                    }

                    public String getTitle() {
                        return title;
                    }

                    public void setTitle(String title) {
                        this.title = title;
                    }

                    public String getDesc() {
                        return desc;
                    }

                    public void setDesc(String desc) {
                        this.desc = desc;
                    }
                }

                public static class BlBean {
                    /**
                     * name : 健臻·血糖指数
                     * title : 不易波动
                     * desc : 天气条件好，血糖不易波动，可适时进行户外锻炼。
                     */

                    private String name;
                    private String title;
                    private String desc;

                    public String getName() {
                        return name;
                    }

                    public void setName(String name) {
                        this.name = name;
                    }

                    public String getTitle() {
                        return title;
                    }

                    public void setTitle(String title) {
                        this.title = title;
                    }

                    public String getDesc() {
                        return desc;
                    }

                    public void setDesc(String desc) {
                        this.desc = desc;
                    }
                }
            }
        }
    }
}
